package com.example.gorokekeyword;

// 카테고리 값 저장용.
// 셀레니움을 켜놓고 실시간으로 값을 불러오는 대신 값을 저장해두고 검색할때만 셀레니움 작동.
public class Category {
    private String[] sub00 = {"이전 분야를 선택하세요"};
    private String[] sub01 = {"소분류 없음"};

    private String[] sub050000 = {"소분류 사용안함", "침실가구", "거실가구", "주방가구", "수납가구", "아동/주니어가구", "서재/사무용가구", "아웃도어가구", "DIY자재/용품", "인테리어소품", "침구단품", "침구세트", "솜류", "카페트/러그", "커튼/블라인드", "홈데코", "수예"};
    private String[] sub120000 = {"소분류 사용안함", "소설/시", "에세이", "경제/경영", "자기계발", "인문", "역사", "사회/정치", "자연/과학", "예술/대중문화", "종교", "유아", "어린이", "가정/요리", "여행", "국어/외국어", "컴퓨터/IT", "청소년", "수험서/자격증", "만화", "잡지", "외국도서", "건강/취미", "고등학교 참고서", "중학교 참고서", "초등학교 참고서", "중고도서"};
    private String[] sub040000 = {"소분류 사용안함", "노트북", "노트북액세서리", "휴대폰액세서리", "카메라/캠코더용품", "영상가전", "음향가전", "생활가전", "이미용가전", "주방가전", "자동차기기", "계절가전", "휴대폰", "학습기기", "게임기/타이틀", "PC", "PC액세서리", "태블릿PC", "태블릿PC액세서리", "모니터", "모니터주변기기", "주변기기", "멀티미디어장비", "저장장치", "PC부품", "네트워크장비", "소프트웨어", "광학기기/용품"};
    private String[] sub110000 = {"소분류 사용안함", "화장품", "향수", "시계/기프트", "주얼리", "패션/잡화", "전자제품", "식품/건강"};
    private String[] sub090000 = {"소분류 사용안함", "공구", "문구/사무용품", "화방용품", "자동차용품", "수집품", "관상어용품", "악기", "반려동물", "음반", "DVD", "종교", "주방용품", "세탁용품", "건강측정용품", "건강관리용품", "당뇨관리용품", "의료용품", "실버용품", "재활운동용품", "물리치료/저주파용품", "좌욕/좌훈용품", "냉온/찜질용품", "구강위생용품", "눈건강용품", "발건강용품", "원예/식물", "정원/원예용품", "안마용품", "블루레이", "욕실용품", "수납/정리용품", "청소용품", "생활용품"};
    private String[] sub080000 = {"소분류 사용안함", "등산", "캠핑", "골프", "자전거", "스키/보드", "낚시", "수영", "헬스", "요가/필라테스", "인라인스케이트", "스케이트/보드/롤러", "오토바이/스쿠터", "축구", "야구", "농구", "배구", "탁구", "배드민턴", "테니스", "스쿼시", "족구", "볼링", "스킨스쿠버", "검도", "댄스", "권투", "보호용품", "무술용품", "수련용품", "스포츠액세서리", "마라톤용품", "당구용품", "기타스포츠용품"};
    private String[] sub070000 = {"소분류 사용안함", "축산", "수산", "농산물", "반찬", "김치", "음료", "과자", "아이스크림/빙수", "가공식품", "냉동/간편조리식품", "건강식품", "다이어트식품", "전통주"};
    private String[] sub100000 = {"소분류 사용안함", "원데이클래스", "국내여행/체험", "해외여행", "렌터카", "생활편의", "예체능레슨", "자기계발/취미 레슨", "홈케어서비스"};
    private String[] sub060000 = {"소분류 사용안함", "분유", "기저귀", "물티슈", "이유식", "아기간식", "수유용품", "유모차", "카시트", "외출용품", "목욕용품", "스킨/바디용품", "위생/건강용품", "구강청결용품", "유아세제", "소독/살균용품", "안전용품", "유아가구", "이유식용품", "임부복", "임산부용품", "유아침구", "출산/돌기념품", "신생아의류", "유아동의류", "유아동언더웨어/잠옷", "유아동잡화", "수영복/용품", "유아동 주얼리", "유아발육용품", "완구/매트", "인형", "교구"};
    private String[] sub010000 = {"소분류 사용안함", "여성의류", "여성언더웨어/잠옷", "남성의류", "남성언더웨어/잠옷"};
    private String[] sub020000 = {"소분류 사용안함", "여성신발", "남성신발", "신발용품", "여성가방", "남성가방", "여행용가방/소품", "지갑", "벨트", "모자", "장갑", "양말", "선글라스/안경테", "헤어액세서리", "패션소품", "시계", "순금", "주얼리"};
    private String[] sub030000 = {"소분류 사용안함", "스킨케어", "베이스메이크업", "색조메이크업", "클렌징", "마스크/팩", "선케어", "남성화장품", "향수", "바디케어", "헤어케어", "헤어스타일링", "네일케어", "뷰티소품"};

    private String[] sub050800 = {"소분류 사용안함", "목재", "반제품", "가구부속품", "바닥재", "손잡이", "타일", "파벽돌", "몰딩", "패널", "벽지", "시트지", "데코스티커", "접착제/보수용품", "리모델링"};
    private String[] sub050200 = {"소분류 사용안함", "소파", "테이블", "TV거실장", "장식장"};
    private String[] sub050600 = {"소분류 사용안함", "책상", "의자", "책장", "책꽂이", "사무/교구용가구"};
    private String[] sub051200 = {"소분류 사용안함", "이불솜", "베개솜/속통", "요솜/매트솜", "쿠션솜", "방석솜"};
    private String[] sub050400 = {"소분류 사용안함", "행거", "수납장", "선반", "공간박스", "고가구", "나비장", "CD/DVD장", "신발장", "우산꽂이", "잡지꽂이", "코너장", "소품수납함"};
    private String[] sub051600 = {"소분류 사용안함", "뜨개질", "자수", "퀼트/펠트", "원단", "수예용품/부자재", "기타수예", "보석십자수"};
    private String[] sub050500 = {"소분류 사용안함", "책상", "책상의자", "책상의자세트", "책꽂이", "책장", "침대", "옷장", "행거", "서랍장", "수납장", "의자", "소파", "소품가구", "아동침실세트"};
    private String[] sub050700 = {"소분류 사용안함", "야외테이블", "야외의자", "정원그네", "정자", "야외벤치", "기타아웃도어가구"};
    private String[] sub050900 = {"소분류 사용안함", "스탠드", "조명", "시계", "액자", "아로마/캔들용품", "우체통", "도어벨", "디자인문패", "냉장고자석", "장식인형", "장식미니어처", "화병", "인테리어파티션", "인테리어창문", "인터폰박스", "인테리어분수", "오르골", "워터볼", "앤틱소품", "전통공예소품", "기타장식용품", "미술작품"};
    private String[] sub050300 = {"소분류 사용안함", "식탁/의자", "레인지대", "왜건/카트", "주방수납장", "그릇장/컵보드", "기타주방가구"};
    private String[] sub051000 = {"소분류 사용안함", "매트/침대커버", "베개", "스프레드", "차렵이불", "홑이불", "패드", "요", "이불커버", "담요", "무릎담요", "전기매트커버", "기타침구단품", "토퍼", "토퍼커버"};
    private String[] sub051100 = {"소분류 사용안함", "요이불세트", "침대커버세트", "매트커버세트", "이불베개세트", "이불패드세트", "한실예단세트"};
    private String[] sub050100 = {"소분류 사용안함", "침대", "매트리스", "장롱/붙박이장", "화장대", "거울", "협탁", "부부테이블", "침실세트", "서랍장"};
    private String[] sub051300 = {"소분류 사용안함", "카페트", "러그", "쿨매트", "대자리", "왕골자리", "발매트"};
    private String[] sub051400 = {"소분류 사용안함", "커튼", "로만셰이드", "커튼/로만세트", "블라인드", "버티컬", "롤스크린", "바란스", "캐노피", "실커튼", "대나무발", "비즈발", "자바라", "커튼액세서리", "콤비블라인드"};
    private String[] sub051500 = {"소분류 사용안함", "커버류", "주방데코", "쿠션/방석"};
    private String[] sub121300 = {"소분류 사용안함", "결혼/가족", "임신/출산", "자녀교육", "인테리어/살림", "요리", "육아"};
    private String[] sub122200 = {"소분류 사용안함", "건강", "취미/레저"};
    private String[] sub120300 = {"소분류 사용안함", "경제", "경영", "마케팅/세일즈", "재테크/투자", "CEO/비즈니스맨"};
    private String[] sub122300 = {"소분류 사용안함", "자습서", "문제집", "수능문제집", "EBS 고등", "기타"};
    private String[] sub121500 = {"소분류 사용안함", "국어", "영어", "일본어", "중국어", "기타외국어", "한자사전", "기타 국가 사전", "백과/전문사전"};
    private String[] sub121900 = {"소분류 사용안함", "공포/추리", "교양만화", "드라마", "명랑/코믹만화", "성인만화", "순정만화", "스포츠만화", "액션/무협만화", "웹툰/카툰에세이", "학원만화", "일본어판 만화", "영문판 만화", "SF/판타지", "기타만화"};
    private String[] sub120700 = {"소분류 사용안함", "정치/외교", "행정", "국방/군사", "법", "사회학", "사회복지", "언론/미디어", "여성학", "교육학"};
    private String[] sub120100 = {"소분류 사용안함", "세계 각국 소설", "고전/문학", "장르소설", "테마문학", "한국소설", "시", "비평/창작/이론", "신화/전설/설화", "희곡/시나리오"};
    private String[] sub121800 = {"소분류 사용안함", "취업/상식/적성검사", "공무원", "고등고시/전문직", "검정고시", "교원임용고시", "경제/금융/회계/물류", "공인중개/주택관리", "국가자격/전문사무", "편입/대학원", "독학사", "컴퓨터수험서"};
    private String[] sub121200 = {"소분류 사용안함", "초등1~2학년", "초등3~4학년", "초등5~6학년", "어린이영어", "어린이동화", "학습/학습만화", "어린이 교양", "어린이 세트"};
    private String[] sub120200 = {"소분류 사용안함", "그림/사진 에세이", "독서 에세이", "명상 에세이", "성공 에세이", "여행 에세이", "연애/사랑 에세이", "명사/연예인 에세이", "명언/잠언록", "음식/요리 에세이", "예술 에세이"};
    private String[] sub121400 = {"소분류 사용안함", "국내여행", "해외여행", "테마여행", "지도"};
    private String[] sub120600 = {"소분류 사용안함", "역사학/이론/비평", "세계사", "서양사", "동양사", "한국사", "주제별 역사/문화"};
    private String[] sub120900 = {"소분류 사용안함", "예술일반/예술사", "미술", "음악", "건축", "만화/애니메이션", "사진", "연극/공연/영화", "TV/라디오"};
    private String[] sub122100 = {"소분류 사용안함", "가족/생활", "건축/예술", "경영경제", "자연/과학", "문학/소설", "외국어/사전", "요리", "유아청소년/교육", "취미/여행", "컴퓨터", "독일", "스페인", "일본도서", "프랑스", "인문/사회/종교"};
    private String[] sub121100 = {"소분류 사용안함", "0~3세", "4~7세", "유아놀이책", "유아그림책", "유아학습", "정가제free"};
    private String[] sub120500 = {"소분류 사용안함", "인문일반", "심리", "철학", "언어학/기호학", "종교학/신화학"};
    private String[] sub120400 = {"소분류 사용안함", "대화/협상", "성공/처세", "시간관리", "자기능력계발", "인간관계", "취업"};
    private String[] sub120800 = {"소분류 사용안함", "공학일반/산업공학", "기계/전기/전자", "농수산/축산", "도시/토목/건설", "물리학", "생물학", "수학", "천문/지구과학", "화학", "과학"};
    private String[] sub122000 = {"소분류 사용안함", "문예/교양지", "자연/공학", "컴퓨터/게임/그래픽", "어학/고시/교육", "연예/영화/만화", "여행/취미/스포츠", "외국잡지", "여성/남성/패션", "요리/건강", "리빙/육아", "경제/시사", "종교", "예술/사진/건축"};
    private String[] sub121000 = {"소분류 사용안함", "개신교", "천주교(가톨릭)", "불교", "종교일반", "기타 종교"};
    private String[] sub122600 = {"소분류 사용안함", "도서", "만화"};
    private String[] sub122400 = {"소분류 사용안함", "중1 자습서", "중1 문제집", "중2 자습서", "중2 문제집", "중3 자습서", "중3 문제집", "EBS 중등", "예비 고1", "특목고 대비", "기타"};
    private String[] sub121700 = {"소분류 사용안함", "학습법/진학 가이드", "청소년 경제/자기계발", "청소년 과학", "청소년 문학", "청소년 예술", "청소년 인문/사회", "논술/면접대비"};
    private String[] sub122500 = {"소분류 사용안함", "초등1학년", "초등2학년", "초등3학년", "초등4학년", "초등5학년", "초등6학년", "한글/한자", "EBS 초등", "기타"};
    private String[] sub121600 = {"소분류 사용안함", "그래픽/멀티미디어", "오피스활용도서", "웹사이트", "컴퓨터 입문/활용", "게임", "OS/데이터베이스", "프로그래밍 언어", "네트워크/보안", "컴퓨터공학"};
    private String[] sub041500 = {"소분류 사용안함", "브랜드PC", "조립/베어본PC", "서버/워크스테이션"};
    private String[] sub042400 = {"소분류 사용안함", "CPU", "RAM", "그래픽카드", "메인보드", "PC케이스", "파워서플라이", "PC케이블", "인터페이스카드", "쿨러", "튜닝용품"};
    private String[] sub041600 = {"소분류 사용안함", "USB액세서리", "마우스패드", "손목받침대", "보안기", "PC받침대", "PC홀더/브라켓", "키보드키스킨/스티커", "클리너", "케이블타이/정리함", "기타PC액세서리"};
    private String[] sub041400 = {"소분류 사용안함", "가정용게임기", "휴대용게임기", "PC게임", "게임타이틀", "게임기주변기기"};
    private String[] sub041100 = {"소분류 사용안함", "전기매트/장판", "전기요/담요/방석", "온풍기", "보일러", "온수기", "에어커튼", "업소용냉온풍기", "라디에이터", "컨벡터", "에어컨", "제습기", "냉온풍기", "가습기", "공기정화기", "냉풍기", "선풍기", "에어컨주변기기", "온수매트", "히터"};
    private String[] sub042700 = {"소분류 사용안함", "망원경", "쌍안경", "천체망원경", "현미경", "광학용품액세서리"};
    private String[] sub042500 = {"소분류 사용안함", "공유기", "랜카드", "라우터", "AP", "KVM스위치", "KVM케이블", "네트워크모듈", "네트워크테스트기", "리피터장비", "무선모뎀", "모뎀", "블루투스동글", "선택기", "스위칭허브", "시리얼장비", "안테나", "컨버터장비", "프린터공유기", "기타네트워크장비"};
    private String[] sub040200 = {"소분류 사용안함", "노트북가방/케이스", "노트북받침대/쿨러", "노트북보호필름", "노트북보안기", "노트북어댑터", "노트북용배터리", "노트북키스킨", "노트북도난방지", "기타노트북액세서리"};
    private String[] sub042200 = {"소분류 사용안함", "Divx플레이어", "DVR", "PC마이크", "PC스피커", "휴대용스피커", "웹캠", "PC헤드셋", "영상수신장비", "사운드카드", "영상편집카드"};
    private String[] sub042000 = {"소분류 사용안함", "모니터받침대", "모니터어댑터", "모니터브라켓", "기타모니터주변기기", "모니터암"};
    private String[] sub040700 = {"소분류 사용안함", "세탁기", "건조기/탈수기", "청소기", "다리미", "디지털도어록", "무전기", "스탠드", "재봉틀", "전화기", "구강청정기", "보풀제거기", "손소독기", "자외선소독기", "핸드드라이어", "연수기", "이온수기", "해충퇴치기", "업소용자외선소독기", "의류관리기", "전신건조기"};
    private String[] sub042600 = {"소분류 사용안함", "운영체제", "보안/백신", "사무/회계", "개발툴", "그래픽/멀티미디어", "번역", "유틸리티"};
    private String[] sub040500 = {"소분류 사용안함", "TV", "영상가전액세서리", "프로젝터", "프로젝터주변기기", "영상플레이어", "디지털액자", "사이니지 모니터"};
    private String[] sub040600 = {"소분류 사용안함", "홈시어터", "오디오", "마이크", "데크", "리시버/앰프", "튜너", "오디오믹서", "턴테이블", "방송음향기기", "스피커", "DAC", "라디오", "카세트플레이어", "CD플레이어", "MD플레이어", "노래반주기", "MP3", "PMP", "MP3/PMP액세서리", "블루투스셋", "이어폰", "헤드폰", "이어폰/헤드폰액세서리"};
    private String[] sub040800 = {"소분류 사용안함", "면도기", "면도기소모품", "드라이어", "고데기", "매직기", "에어브러시", "헤어롤/롤셋", "코털제거기", "눈썹정리기", "손발톱정리기", "두피케어기기", "피부케어기기", "제모기", "이발기", "기타이미용가전", "이미용가전액세서리"};
    private String[] sub041000 = {"소분류 사용안함", "블랙박스/액세서리", "내비게이션/액세서리", "하이패스/GPS", "전방/후방카메라", "자동차TV/모니터", "카오디오음향기기", "카팩", "헤드유닛", "방음/방진용품", "자동차AV용품", "핸즈프리"};
    private String[] sub042300 = {"소분류 사용안함", "외장HDD", "외장SSD", "NAS", "USB메모리", "HDD", "SSD", "ODD", "공미디어", "기타저장장치", "저장장치액세서리"};
    private String[] sub040900 = {"소분류 사용안함", "냉장고", "김치냉장고", "냉동고", "전용냉장고", "가스레인지", "가스레인지후드", "전기밥솥", "전자레인지", "오븐", "인덕션", "하이라이트", "하이브리드", "핫플레이트", "식기세척/건조기", "전기포트", "정수기", "커피머신", "토스터기", "진공포장기", "음식물처리기", "커피메이커", "커피자판기", "제빵기", "거품/반죽기", "전기그릴", "생선그릴", "쥬서기/녹즙기", "믹서기", "빙수기", "분쇄기", "요구르트제조기", "두부두유제조기", "식품건조기", "홍삼제조기", "아이스크림제조기", "핸드블렌더", "전기쿠커", "튀김기", "전기팬", "죽제조기", "샌드위치제조기", "와플제조기", "탄산수제조기", "기타주방가전", "업소용튀김기", "업소용음식물처리기", "업소용믹서기", "업소용진공포장기", "업소용빙수기", "업소용거품/반죽기", "에어프라이어", "기타주방가전부속품"};
    private String[] sub042100 = {"소분류 사용안함", "마우스", "키보드", "키보드/마우스세트", "태블릿/액세서리", "복합기", "프린터", "복합기/프린터소모품", "스캐너"};
    private String[] sub040400 = {"소분류 사용안함", "DSLR카메라", "미러리스디카", "일반디카", "캠코더", "카메라렌즈", "렌즈용품", "즉석카메라", "필름카메라", "메모리카드", "카드리더기", "카메라가방/케이스", "카메라스트랩/그립", "삼각대/헤드", "플래시/조명용품", "충전기/배터리", "LCD용품/보호필름", "필름/관련용품", "카메라/캠코더 관련용품", "액션캠"};
    private String[] sub041800 = {"소분류 사용안함", "케이스/파우치", "스탠드/Dock", "태블릿PC보호필름", "터치펜/기타"};
    private String[] sub041300 = {"소분류 사용안함", "전자사전", "전자책", "어학학습기", "학습보조기", "보이스레코더", "학습기기액세서리"};
    private String[] sub041200 = {"소분류 사용안함", "SKT", "KT", "LG U+", "공기계/중고폰", "해외출시폰", "MVNO", "자급제폰", "선불폰"};
    private String[] sub040300 = {"소분류 사용안함", "휴대폰케이스", "휴대폰보호필름", "휴대폰충전기", "휴대폰배터리", "휴대폰케이블", "휴대폰젠더", "휴대폰렌즈", "휴대폰거치대", "휴대폰줄", "휴대폰이어캡", "핸드셋", "휴대폰DMB수신기", "웨어러블 디바이스", "휴대폰쿨링패드", "기타휴대폰액세서리", "짐벌", "셀카봉", "웨어러블 디바이스 액세서리"};
    private String[] sub110300 = {"소분류 사용안함", "시계", "필기도구", "라이터", "크리스탈", "수첩/다이어리", "생활소품"};
    private String[] sub110700 = {"소분류 사용안함", "건강식품", "홍삼/인삼", "기호식품"};
    private String[] sub110600 = {"소분류 사용안함", "노트북/주변기기", "카메라/캠코더", "가전제품", "MP3/이어폰/헤드폰", "기타전자제품"};
    private String[] sub110400 = {"소분류 사용안함", "귀걸이", "목걸이", "반지", "펜던트", "팔찌", "발찌", "헤어", "넥타이핀", "커프스", "브로치", "키홀더", "휴대폰줄", "장식소품"};
    private String[] sub110500 = {"소분류 사용안함", "가방", "지갑", "벨트", "선글라스", "안경", "넥타이", "스카프/머플러", "의류", "신발", "언더웨어", "모자", "장갑", "양말", "우산/양산", "패션소품", "여행소품"};
    private String[] sub110200 = {"소분류 사용안함", "여성향수", "남성향수"};
    private String[] sub110100 = {"소분류 사용안함", "스킨케어", "메이크업", "클렌징", "선케어", "바디케어", "헤어케어", "남성화장품", "아동화장품"};
    private String[] sub091000 = {"소분류 사용안함", "영화", "드라마", "애니메이션", "뮤직비디오", "취미/스포츠", "교육", "교양/다큐멘터리", "유아/어린이", "종교"};
    private String[] sub091500 = {"소분류 사용안함", "건강목걸이", "건강팔찌", "금연용품", "뜸/뜸기구", "수지침", "먼지차단마스크", "수액시트", "지압기", "코건강용품", "코클리너", "파라핀용품", "기타건강관리용품", "전자담배", "전자담배 액세서리", "소음방지귀마개", "위생마스크", "마스크액세서리"};
    private String[] sub091400 = {"소분류 사용안함", "체중계", "만보계", "신장계", "체온계", "혈압계", "심박계", "청진기"};
    private String[] sub090100 = {"소분류 사용안함", "전동공구", "수작업공구", "측정공구", "목공공구", "설비공구", "절삭공구", "용접공구", "예초기", "원예공구", "에어공구", "소형기계", "전기용품", "페인트", "페인트용품", "운반용품", "포장용품", "접착용품", "체결용품", "안전용품"};
    private String[] sub090600 = {"소분류 사용안함", "사료", "수조장식용품", "수조청소용품", "수족관/어항", "수초", "에어/기포", "모터", "히터", "조명", "여과기/여과제"};
    private String[] sub092300 = {"소분류 사용안함", "구강청정제/가글", "치실/치간칫솔", "치아미백제", "치약", "칫솔", "칫솔치약세트", "혀클리너", "마우스피스", "틀니관리용품", "치석제거기"};
    private String[] sub092200 = {"소분류 사용안함", "찜질기", "찜질팩"};
    private String[] sub092400 = {"소분류 사용안함", "렌즈세정액", "렌즈세척기", "안대", "기타렌즈용품"};
    private String[] sub091600 = {"소분류 사용안함", "침/바늘", "혈당측정지", "혈당계"};
    private String[] sub090200 = {"소분류 사용안함", "필기도구", "노트/수첩", "다이어리/플래너", "앨범", "이벤트/파티용품", "데스크용품", "보드/칠판", "용지", "사무기기", "제도용품", "스티커/테이프", "스탬프/도장", "문구용품", "파일/바인더", "지도/지구본", "카드/엽서/봉투", "사무용품"};
    private String[] sub092000 = {"소분류 사용안함", "저주파안마기", "저주파자극기", "저주파패드", "적외선조사기", "디스크/관절용품", "부항기", "물리치료용품"};
    private String[] sub090800 = {"소분류 사용안함", "햄스터용품", "고슴도치용품", "토끼용품", "조류용품", "기타반려동물용품", "강아지 사료", "강아지 간식", "강아지 배변용품", "강아지 건강/관리용품", "미용/목욕", "강아지 장난감/훈련", "고양이 사료", "고양이 간식", "고양이 배변용품", "고양이 건강/관리용품", "고양이 캣타워", "고양이 장난감", "리빙용품", "패션용품", "식기/급수기", "이동장/외출용품", "야외용품", "서비스"};
    private String[] sub092500 = {"소분류 사용안함", "건강슬리퍼", "다리/발마사지기", "발지압/발매트", "족욕/족탕기", "발보호대/패드", "발가락교정기", "발냄새제거제", "발각질제거기"};
    private String[] sub092900 = {"소분류 사용안함", "영화", "드라마", "유아/어린이", "애니메이션", "뮤직비디오", "취미/스포츠", "종교", "교육", "교양/다큐멘터리"};
    private String[] sub093300 = {"소분류 사용안함", "화장지", "생리대", "성인용기저귀", "세제/세정제", "섬유유연제", "제습/방향/탈취", "해충퇴치용품", "생활잡화", "보안용품", "생활선물세트"};
    private String[] sub091300 = {"소분류 사용안함", "빨래건조대", "다림판", "다림풀", "빨래바구니", "빨래삶통", "빨랫줄", "빨래집게", "빨래판", "세탁망", "세탁볼", "세탁솔", "세탁잡화"};
    private String[] sub093100 = {"소분류 사용안함", "선반/진열대", "정리함", "옷걸이", "바구니", "소품걸이", "옷커버", "압축팩", "선풍기커버", "마네킹"};
    private String[] sub090500 = {"소분류 사용안함", "서예/글씨", "LP", "공예품", "포스터", "이색수집품", "게임", "퍼즐/블록", "모형/프라모델/피규어", "무선/RC", "서바이벌", "화폐", "우표/씰", "중고도서", "코스튬플레이", "아이돌굿즈"};
    private String[] sub091800 = {"소분류 사용안함", "휠체어", "보행보조용품", "보행차/실버카", "목욕보조용품", "배변보조용품", "욕창방지용품", "장례용품/수의", "돋보기", "보청기"};
    private String[] sub090700 = {"소분류 사용안함", "기타(guitar)", "피아노", "건반악기", "현악기", "관악기", "타악기", "국악기", "음향기자재", "기타악기"};
    private String[] sub092800 = {"소분류 사용안함", "안마의자", "렌탈안마의자", "안마기", "쿠션안마기", "안마매트", "기타안마용품"};
    private String[] sub093000 = {"소분류 사용안함", "비데/비데용품", "욕조/반신욕용품", "욕실잡화", "샤워기/수전용품", "면도용품", "샤워/목욕용품", "수건/타월", "욕실장/선반", "욕실청소용품", "욕실용기/홀더", "욕실발판/욕실매트", "위생도기"};
    private String[] sub092600 = {"소분류 사용안함", "공기정화식물", "관엽식물", "다육식물", "수경식물", "식용식물", "넝쿨식물", "허브식물", "천연잔디", "미니화분", "분재", "숯부작", "토피어리", "씨앗/모종", "조화", "보존화", "금꽃", "비누꽃", "종이꽃", "플라워소품만들기", "테라리엄"};
    private String[] sub090900 = {"소분류 사용안함", "국내앨범", "해외앨범"};
    private String[] sub091700 = {"소분류 사용안함", "거즈/붕대/솜류", "구급/응급용품", "석션기/네블라이저", "핀셋/포셉/겸자류", "의료용가구"};
    private String[] sub090400 = {"소분류 사용안함", "차량용케이블", "스노우체인", "배터리", "시트커버", "DIY용품", "램프", "차량실내용품", "배터리용품", "공기청정용품", "세차용품", "키용품", "편의용품", "오일관리", "익스테리어용품", "인테리어용품", "전기용품", "수납용품", "휴대폰용품", "타이어/휠", "튜닝용품"};
    private String[] sub091900 = {"소분류 사용안함", "목보호대", "자세교정용품", "의료용압박스타킹", "재활운동기구", "기타재활운동용품", "상반신보조기", "하반신보조기"};
    private String[] sub092700 = {"소분류 사용안함", "물조리개", "수반", "원예부자재", "자갈/모래/흙", "정원데코", "정원부자재", "조경수/묘목", "화분", "화분대", "화분받침", "화분영양제/비료"};
    private String[] sub091100 = {"소분류 사용안함", "기독교용품", "천주교용품", "불교용품"};
    private String[] sub092100 = {"소분류 사용안함", "좌욕기", "좌훈기"};
    private String[] sub091200 = {"소분류 사용안함", "도마", "식기", "잔/컵", "냄비/솥", "프라이팬", "주전자/티포트", "보관/밀폐용기", "칼/커팅기구", "교자상/밥상", "주방수납용품", "조리기구", "커피용품", "와인용품", "제과/제빵용품", "주방잡화", "제수용품"};
    private String[] sub093200 = {"소분류 사용안함", "휴지통", "밀대/패드", "빗자루/쓰레받기", "걸레", "먼지떨이/먼지제거기", "솔", "유리닦이용품", "테이프클리너", "회전청소기", "매직블럭", "기타청소용품"};
    private String[] sub090300 = {"소분류 사용안함", "우드락/폼보드", "서예/동양화용품", "미술도구수납용품", "미술보조용품", "전문지류/미술지류", "페인트/염료/잉크", "붓", "물감/포스터컬러", "스케치/드로잉용품", "애니메이션용품", "조소/판화용품"};
    private String[] sub082400 = {"소분류 사용안함", "죽도", "죽도집/부속품", "타격대", "도복", "기타검도용품", "검도보호용품"};
    private String[] sub080300 = {"소분류 사용안함", "골프클럽", "골프백", "골프의류", "골프잡화", "골프연습용품", "골프필드용품", "골프화", "골프공", "로스트볼", "파크골프"};
    private String[] sub082600 = {"소분류 사용안함", "글러브", "미트", "샌드백", "핸드랩"};
    private String[] sub080600 = {"소분류 사용안함", "낚싯대", "낚시릴", "낚싯줄", "루어낚시", "민물낚시", "바다낚시", "낚시용품", "낚시의류/잡화", "낚시공구"};
    private String[] sub081500 = {"소분류 사용안함", "농구화", "농구대", "농구공", "농구공가방", "기타농구용품", "농구의류"};
    private String[] sub082500 = {"소분류 사용안함", "댄스소품", "댄스복"};
    private String[] sub080100 = {"소분류 사용안함", "등산화", "등산의류", "등산가방", "등산장비", "등산잡화", "기타등산장비"};
    private String[] sub082800 = {"소분류 사용안함", "목검/가검", "봉/곤/창", "기타무술용품"};
    private String[] sub081600 = {"소분류 사용안함", "배구공", "배구네트", "배구화", "기타배구용품", "배구의류"};
    private String[] sub081800 = {"소분류 사용안함", "배드민턴라켓", "배드민턴화", "배드민턴가방", "셔틀콕", "스트링", "그립", "배드민턴네트", "연습용품", "기타배드민턴용품", "배드민턴의류"};
    private String[] sub082700 = {"소분류 사용안함", "마우스피스", "머리보호대", "급소보호대", "몸통보호대", "배보호대", "팔보호대", "테이핑요법", "손목보호대", "다리보호대", "무릎보호대", "발목보호대", "허리보호대", "어깨보호대"};
    private String[] sub082200 = {"소분류 사용안함", "볼링공", "볼링용품", "볼링화", "아대", "볼링가방", "볼링의류"};
    private String[] sub082900 = {"소분류 사용안함", "무도복", "수련화", "띠/벨트", "격파용품", "기타수련용품"};
    private String[] sub080700 = {"소분류 사용안함", "남성수영복", "여성수영복", "비치웨어", "수영용품"};
    private String[] sub081100 = {"소분류 사용안함", "스케이트보드", "스네이크보드", "아이스스케이트", "롤러슈즈", "킥보드", "트라이스키", "스케이트보드용품", "핑거보드"};
    private String[] sub082000 = {"소분류 사용안함", "스쿼시라켓", "스쿼시공", "기타스쿼시용품"};
    private String[] sub080500 = {"소분류 사용안함", "보드복", "스키복", "스키/보드방한용품", "스노보드장비", "스키장비", "스키/보드용품"};
    private String[] sub082300 = {"소분류 사용안함", "다이빙슈트", "부력재킷", "부츠", "다이빙칼", "글러브", "게이지", "기어백", "레귤레이터", "리트렉터", "수중전등", "수중총/작살", "옥토퍼스", "호스", "납", "기타스킨스쿠버용품"};
    private String[] sub083000 = {"소분류 사용안함", "스포츠선글라스", "스포츠헤어밴드", "스포츠토시", "스포츠마스크", "스포츠넥워머", "아이스머플러/스카프", "볼캐리어", "스코어보드/작전판", "호각/호루라기"};
    private String[] sub081400 = {"소분류 사용안함", "포수장비", "야구보호대", "야구공", "야구양말", "야구가방", "기타야구용품", "글러브", "헬멧", "야구화", "야구배트", "야구장갑", "야구의류"};
    private String[] sub081200 = {"소분류 사용안함", "오토바이", "오토바이용품", "오토바이부품", "오토바이의류/잡화", "전동휠", "스쿠터"};
    private String[] sub080900 = {"소분류 사용안함", "요가복", "요가매트", "요가링/필라테스링", "기타요가용품", "필라테스"};
    private String[] sub081000 = {"소분류 사용안함", "주니어", "성인용", "인라인용품"};
    private String[] sub080400 = {"소분류 사용안함", "자전거/MTB", "자전거의류/잡화", "자전거부품", "자전거용품"};
    private String[] sub082100 = {"소분류 사용안함", "족구공", "족구네트", "족구의류", "족구화", "기타족구용품"};
    private String[] sub081300 = {"소분류 사용안함", "축구화", "풋살화", "축구공", "축구가방", "축구장갑", "축구보호대", "축구양말", "축구연습용품", "기타축구용품", "축구의류"};
    private String[] sub080200 = {"소분류 사용안함", "텐트", "타프", "텐트/타프용품", "천막", "침낭", "캠핑매트", "랜턴", "취사용품", "캠핑가구", "캠핑웨건", "아이스박스", "기타캠핑용품"};
    private String[] sub081700 = {"소분류 사용안함", "탁구라켓", "탁구공", "탁구화", "탁구대", "기타탁구용품", "탁구의류"};
    private String[] sub081900 = {"소분류 사용안함", "테니스라켓", "테니스화", "테니스공", "테니스가방", "그립", "스트링", "기타테니스용품", "테니스의류"};
    private String[] sub080800 = {"소분류 사용안함", "러닝머신", "웨이트기구", "헬스소품", "진동운동기", "복근운동기구", "거꾸리", "벨트마사지", "승마운동기", "헬스사이클", "로잉머신", "아령/덤벨", "줄넘기", "훌라후프", "일립티컬", "스텝퍼", "트위스트", "트램펄린", "케틀벨"};
    private String[] sub070900 = {"소분류 사용안함", "라면", "면류", "치즈", "조미료", "식용유/오일", "장류", "소스", "수산가공식품", "물엿", "요구르트", "생크림", "마가린", "버터", "누룽지", "스프", "오트밀", "통조림", "밀가루", "설탕", "소금", "시럽", "잼", "떡", "빵", "케이크", "즉석밥", "죽", "우유", "두유", "시리얼", "튀김가루", "부침가루", "빵가루", "기타분말가루", "간편조리식", "제과/제빵재료", "파우더/스무디", "쿠킹박스"};
    private String[] sub071100 = {"소분류 사용안함", "건강음료", "건강환/정", "건강분말", "비타민제", "홍삼", "인삼", "한방재료", "꿀", "영양제", "건강즙", "과일즙"};
    private String[] sub070700 = {"소분류 사용안함", "쿠키", "초콜릿", "사탕", "스낵", "껌", "엿", "젤리", "푸딩", "캐러멜", "팝콘/강냉이류", "강정", "한과", "전병", "화과자", "가공안주류", "기타과자"};
    private String[] sub070500 = {"소분류 사용안함", "포기김치", "갓김치", "총각김치", "깍두기", "겉절이", "나박김치", "동치미", "묵은지", "백김치", "열무김치", "별미김치", "절임배추", "파김치"};
    private String[] sub071000 = {"소분류 사용안함", "피자", "핫도그", "햄버거", "딤섬", "만두", "채식푸드", "샐러드", "어묵", "즉석국/즉석탕", "튀김류", "기타냉동/간편조리식품", "도시락"};
    private String[] sub070300 = {"소분류 사용안함", "쌀", "잡곡/혼합곡", "과일", "채소", "견과류", "건과류"};
    private String[] sub071200 = {"소분류 사용안함", "다이어트차", "다이어트바", "가르시니아", "식이섬유", "CLA", "헬스보충제", "뷰티푸드", "기타다이어트식품", "곤약", "콜라겐", "와일드망고", "잔티젠", "카테킨", "히알루론산", "레몬밤"};
    private String[] sub070400 = {"소분류 사용안함", "절임류", "조림류", "장아찌", "장조림", "반찬세트", "기타반찬류"};
    private String[] sub070200 = {"소분류 사용안함", "생선", "김/해초", "해산물/어패류", "젓갈", "건어물"};
    private String[] sub070800 = {"소분류 사용안함", "아이스크림", "빙수/빙수재료"};
    private String[] sub070600 = {"소분류 사용안함", "생수", "탄산수", "청량/탄산음료", "주스/과즙음료", "커피", "차류"};
    private String[] sub071300 = {"소분류 사용안함", "탁주", "약주", "소주", "일반증류주", "리큐르주", "기타주류", "과실주", "전통주선물세트"};
    private String[] sub070100 = {"소분류 사용안함", "돼지고기", "쇠고기", "닭고기", "오리고기", "양고기", "알류", "축산가공식품", "기타육류"};
    private String[] sub100200 = {"소분류 사용안함", "국내패키지/기타", "국내숙박", "국내항공권", "공연/티켓", "액티비티"};
    private String[] sub100400 = {"소분류 사용안함", "단기렌터카", "장기렌터카"};
    private String[] sub100500 = {"소분류 사용안함", "e쿠폰", "사진/영상 촬영", "지류/카드 상품권", "온라인 콘텐츠", "꽃/케이크배달"};
    private String[] sub100600 = {"소분류 사용안함", "무예/무도", "골프레슨", "구기 스포츠", "아웃도어스포츠", "댄스/무용", "보컬/악기", "미술", "피트니스/PT", "필라테스/요가", "기타"};
    private String[] sub100100 = {"소분류 사용안함", "수공예 클래스", "쿠킹 클래스", "기타클래스"};
    private String[] sub100700 = {"소분류 사용안함", "외국어", "공예", "뷰티", "커피/요리", "취업/자격증/기타"};
    private String[] sub100300 = {"소분류 사용안함", "해외패키지/기타", "해외숙박", "해외항공권", "와이파이/USIM"};
    private String[] sub100800 = {"소분류 사용안함", "가전/가구 설치", "이사/청소"};
    private String[] sub063200 = {"소분류 사용안함", "학습교구", "학습보드게임", "비디오/DVD"};
    private String[] sub061300 = {"소분류 사용안함", "유아칫솔", "유아치약", "유아구강세정제", "유아구강청결티슈", "손가락빨기방지용품", "기타구강청결용품"};
    private String[] sub060200 = {"소분류 사용안함", "국내기저귀", "수입기저귀", "기능성기저귀"};
    private String[] sub061000 = {"소분류 사용안함", "유아욕조", "유아목욕의자", "유아목욕가운", "유아목욕타월", "유아샴푸캡", "유아목욕장갑/스펀지", "유아세면대/수도꼭지", "유아욕탕온도계", "유아목욕장난감", "욕실정리망/정리함", "기타목욕용품"};
    private String[] sub060300 = {"소분류 사용안함", "캡형", "리필형", "휴대용", "혼합세트", "기능성물티슈", "코인티슈/업소용", "물티슈워머/물티슈캡"};
    private String[] sub060100 = {"소분류 사용안함", "국내분유", "수입분유", "특수분유"};
    private String[] sub061500 = {"소분류 사용안함", "젖병소독기", "젖병세정제", "젖병솔", "젖병집게", "젖병건조대", "장난감소독기"};
    private String[] sub062700 = {"소분류 사용안함", "남아수영복", "여아수영복", "수경/수모/귀마개", "수영가방/비치백"};
    private String[] sub060600 = {"소분류 사용안함", "젖병", "젖꼭지", "노리개젖꼭지", "유축기", "분유케이스", "보틀워머", "모유보관비닐팩", "수유쿠션/시트", "수유가리개", "수유패드", "유두케어/젖몸살용품", "기타수유용품"};
    private String[] sub061100 = {"소분류 사용안함", "기저귀크림", "유아크림", "유아로션", "유아오일", "유아선크림", "유아파우더", "유아립케어", "유아비누", "유아바스/샴푸", "유아입욕제", "혼합세트", "색조화장품", "어린이네일케어", "기타스킨/바디용품"};
    private String[] sub062300 = {"소분류 사용안함", "레그/스패츠", "바디슈트/롬퍼", "배냇저고리", "손/발싸개", "신생아모자/보닛", "우주복", "가제손수건", "세트"};
    private String[] sub060500 = {"소분류 사용안함", "유아두유", "유아과자", "유아유제품", "유아음료"};
    private String[] sub061600 = {"소분류 사용안함", "안전문", "모서리보호대", "머리보호대", "무릎보호대", "문닫힘방지", "디딤대", "모기밴드/퇴치용품", "안전잠금장치", "콘센트안전커버"};
    private String[] sub063000 = {"소분류 사용안함", "놀이방매트", "작동완구", "감각발달완구", "공간놀이기구", "물놀이용품", "미술놀이", "블록", "스포츠완구", "승용완구", "유아/어린이자전거", "신생아/영유아완구", "언어/학습완구", "역할놀이/소꿉놀이", "원목교구/가베", "자연/과학완구", "유아동퍼즐", "음악/악기놀이", "캐릭터카드/딱지"};
    private String[] sub060900 = {"소분류 사용안함", "아기띠", "아기띠쿨러/패드", "아기띠침받이", "기저귀가방", "힙시트", "포대기/처네", "망토/워머", "슬링", "미아방지용품", "기타외출용품"};
    private String[] sub061200 = {"소분류 사용안함", "유아변기/커버", "유아면봉", "유아손톱가위/손톱깎이", "유아손세정제", "유아마스크", "기저귀휴지통", "분통/파우더통", "유아이발용품", "제균스프레이", "콧물흡입기", "키재기", "투약기", "해열시트", "유아항균팩"};
    private String[] sub060700 = {"소분류 사용안함", "초경량/휴대용", "절충형/디럭스형", "쌍둥이용", "유모차/카시트 세트", "유모차용품"};
    private String[] sub061700 = {"소분류 사용안함", "유아이유식의자", "유아침대", "유아책상", "유아공부상", "유아의자", "유아소파", "유아옷걸이", "장난감정리함", "기저귀정리함", "기타유아가구"};
    private String[] sub062800 = {"소분류 사용안함", "목걸이", "귀걸이", "팔찌", "펜던트", "순금돌반지", "순금주얼리", "주얼리세트"};
    private String[] sub062500 = {"소분류 사용안함", "잠옷/홈웨어", "수면조끼", "내의/내복", "러닝", "팬티", "브라", "러닝팬티세트", "브라팬티세트", "속치마/속바지", "배변훈련팬티"};
    private String[] sub062400 = {"소분류 사용안함", "티셔츠", "블라우스", "셔츠/남방", "조끼", "니트/스웨터", "카디건", "원피스", "상하세트", "재킷", "점퍼", "코트", "레깅스", "바지", "청바지", "스커트", "트레이닝복", "정장", "드레스", "공주드레스", "점프슈트", "패밀리룩", "레인코트", "교복", "한복", "스키복", "발레복/댄스복", "코스튬의상"};
    private String[] sub062600 = {"소분류 사용안함", "신발", "가방", "지갑", "모자", "양말", "타이즈", "장갑", "귀마개", "목도리", "스카프", "앞치마/토시/두건", "넥타이", "선글라스", "벨트/멜빵", "우산", "헤어액세서리", "기타유아동잡화"};
    private String[] sub062900 = {"소분류 사용안함", "바운서/흔들침대", "보행기", "쏘서", "점퍼루"};
    private String[] sub061400 = {"소분류 사용안함", "유아세탁세제", "유아유연제", "유아세탁비누", "유아표백제/얼룩제거제", "혼합세트"};
    private String[] sub062100 = {"소분류 사용안함", "속싸개", "겉싸개", "유아베개", "낮잠이불", "아기이불/요/패드", "방수요", "DIY 아기용품", "보낭/슬리핑백", "기타유아침구"};
    private String[] sub060400 = {"소분류 사용안함", "가공이유식", "수제이유식", "이유식재료"};
    private String[] sub061800 = {"소분류 사용안함", "유아컵", "유아식기", "유아스푼/포크", "연습용젓가락", "턱받이", "조리기", "과즙망", "기타이유식용품"};
    private String[] sub063100 = {"소분류 사용안함", "봉제인형", "캐릭터/패션인형", "기타인형"};
    private String[] sub061900 = {"소분류 사용안함", "수유복", "원피스", "바지", "청바지", "트레이닝복/요가복", "스커트", "스타킹", "레깅스", "임부용수영복", "임부속옷"};
    private String[] sub062000 = {"소분류 사용안함", "임산부화장품", "모유촉진제", "전자파차단앞치마", "산모방석", "임산부보호대", "임산부바디필로우", "태교용품", "기타임산부용품"};
    private String[] sub062200 = {"소분류 사용안함", "셀프촬영", "돌잔치용품", "기저귀케이크", "유치보관함", "탯줄보관함", "손발도장", "탯줄도장", "성장카드", "성장앨범/액자", "기타출산/돌기념품"};
    private String[] sub060800 = {"소분류 사용안함", "바구니형", "일체형", "분리형", "카시트용품"};
    private String[] sub010400 = {"소분류 사용안함", "팬티", "러닝", "러닝팬티세트", "잠옷/홈웨어", "시즌성내의", "보정속옷"};
    private String[] sub010300 = {"소분류 사용안함", "니트/스웨터", "티셔츠", "셔츠/남방", "카디건", "점퍼", "재킷", "코트", "청바지", "바지", "조끼", "정장세트", "트레이닝복", "한복", "유니폼/단체복", "레인코트", "코디세트", "점프슈트"};
    private String[] sub010200 = {"소분류 사용안함", "브라", "팬티", "브라팬티세트", "잠옷/홈웨어", "시즌성내의", "보정속옷", "슬립", "러닝/캐미솔", "속치마/속바지", "언더웨어소품"};
    private String[] sub010100 = {"소분류 사용안함", "니트/스웨터", "카디건", "원피스", "티셔츠", "블라우스/셔츠", "점퍼", "재킷", "코트", "바지", "청바지", "스커트", "레깅스", "트레이닝복", "조끼", "정장세트", "한복", "유니폼/단체복", "파티복", "레인코트", "점프슈트", "코디세트"};
    private String[] sub020500 = {"소분류 사용안함", "백팩", "크로스백", "숄더백", "토트백", "브리프케이스", "클러치백", "힙색"};
    private String[] sub020200 = {"소분류 사용안함", "운동화", "부츠", "워커", "모카신/털신", "스니커즈", "구두", "실내화", "슬리퍼", "웰트화", "슬립온", "보트슈즈", "샌들", "기능화"};
    private String[] sub020900 = {"소분류 사용안함", "스냅백", "군모", "야구모자", "비니", "귀달이모자", "방울털모자", "귀마개", "페도라", "두건/반다나", "사파리모자", "헌팅캡", "선캡", "베레모"};
    private String[] sub020800 = {"소분류 사용안함", "여성벨트", "남성벨트", "멜빵"};
    private String[] sub021200 = {"소분류 사용안함", "선글라스", "선글라스 케이스/소품", "안경테", "안경케이스", "안경소품", "안경줄"};
    private String[] sub021600 = {"소분류 사용안함", "골드바", "실버바", "순금기념품"};
    private String[] sub021500 = {"소분류 사용안함", "커플시계", "아동시계", "시계수리용품", "패션시계", "시계소품"};
    private String[] sub020300 = {"소분류 사용안함", "신발깔창", "신발끈", "보호쿠션/패드", "부츠키퍼", "구둣주걱", "슈즈커버", "기타신발용품"};
    private String[] sub021100 = {"소분류 사용안함", "여성양말", "남성양말"};
    private String[] sub020400 = {"소분류 사용안함", "백팩", "크로스백", "숄더백", "토트백", "파우치", "클러치백", "가방소품", "힙색"};
    private String[] sub020100 = {"소분류 사용안함", "부츠", "부티", "워커", "단화", "힐/펌프스", "운동화", "실내화", "슬리퍼", "샌들", "기능화"};
    private String[] sub020600 = {"소분류 사용안함", "기내용 캐리어", "중대형 캐리어", "여행소품케이스", "보스턴가방", "복대", "이민/유학용 가방", "슈트케이스", "여권지갑/케이스", "네임태그", "잠금벨트/자물쇠", "캐리어소품", "캐리어커버"};
    private String[] sub021000 = {"소분류 사용안함", "여성장갑", "남성장갑", "암워머/토시"};
    private String[] sub021700 = {"소분류 사용안함", "반지", "귀걸이", "목걸이", "팔찌", "펜던트", "주얼리세트", "주얼리소품", "발찌"};
    private String[] sub020700 = {"소분류 사용안함", "여성지갑", "남성지갑", "머니클립", "카드/명함지갑", "동전지갑", "열쇠지갑", "통장지갑", "지갑기타세트"};
    private String[] sub021400 = {"소분류 사용안함", "스카프", "손수건", "넥타이", "커프스", "머플러", "넥워머", "숄", "넥케이프", "행커치프", "우산", "양산", "스타킹", "브로치", "키홀더", "부채", "와펜", "코르사주", "한복소품", "라이터/담배용품", "기타패션소품"};
    private String[] sub021300 = {"소분류 사용안함", "가발", "헤어밴드", "헤어핀", "헤어끈", "헤어액세서리소품"};
    private String[] sub030700 = {"소분류 사용안함", "스킨", "로션", "에센스", "크림", "아이케어", "올인원", "선크림", "클렌징", "스크럽/필링", "마스크/팩", "메이크업", "쉐이빙폼", "남성청결제", "남성화장품세트"};
    private String[] sub031200 = {"소분류 사용안함", "매니큐어", "네일아트", "네일영양제", "네일리무버", "네일케어도구", "네일케어세트"};
    private String[] sub030500 = {"소분류 사용안함", "마스크시트", "필오프팩", "워시오프팩", "코팩", "수면팩", "마사지크림/젤", "마스크/팩세트"};
    private String[] sub030900 = {"소분류 사용안함", "바디크림", "바디오일", "바디미스트", "바디파우더", "바디클렌저", "바디스크럽", "여성청결제", "목욕비누", "핸드케어", "풋케어", "입욕제", "아로마테라피", "데오드란트", "제모제", "바디슬리밍", "바디케어세트", "바디로션", "샤워코롱"};
    private String[] sub030200 = {"소분류 사용안함", "BB크림", "CC크림", "메이크업베이스", "프라이머", "파운데이션", "파우더", "트윈케이크", "컨실러", "베이스메이크업세트"};
    private String[] sub031300 = {"소분류 사용안함", "아이소품", "페이스소품", "헤어소품", "바디소품", "메이크업브러시", "타투", "화장품케이스", "DIY화장품재료"};
    private String[] sub030300 = {"소분류 사용안함", "립스틱", "립케어", "립글로스", "립틴트", "립라이너", "아이섀도", "아이라이너", "마스카라", "아이브로", "블러셔", "하이라이터/쉐이딩", "색조메이크업세트", "속눈썹영양제"};
    private String[] sub030600 = {"소분류 사용안함", "선크림", "선스프레이", "선스틱", "선파우더/쿠션", "애프터선", "선케어세트", "태닝"};
    private String[] sub030100 = {"소분류 사용안함", "넥케어", "스킨/토너", "로션", "에센스", "크림", "아이케어", "미스트", "페이스오일", "화장품세트", "톤업크림"};
    private String[] sub030400 = {"소분류 사용안함", "클렌징폼", "클렌징오일", "클렌징크림", "클렌징로션", "클렌징젤", "클렌징워터", "클렌징티슈", "클렌징비누", "클렌징파우더", "립앤아이리무버", "스크럽/필링", "클렌징세트"};
    private String[] sub030800 = {"소분류 사용안함", "여성향수", "남성향수", "남녀공용향수", "향수세트"};
    private String[] sub031100 = {"소분류 사용안함", "헤어왁스", "헤어스프레이", "헤어무스", "헤어젤", "헤어글레이즈", "염색약", "파마약"};
    private String[] sub031000 = {"소분류 사용안함", "샴푸", "린스", "트리트먼트", "헤어에센스", "헤어팩", "헤어미스트", "두피케어", "탈모케어", "헤어케어세트"};

    private String[] sub050803 = {"소분류 사용안함", "가구다리", "가구바퀴", "경첩/꺽쇠/자석철물류", "나사/못", "로프/철망", "서랍레일", "소켓/옷걸이봉", "기타가구부속품"};
    private String[] sub050814 = {"소분류 사용안함", "중문", "욕실/바스", "싱크대", "창문/창호/새시"};
    private String[] sub050804 = {"소분류 사용안함", "마루", "매트류", "온돌마루", "인조잔디", "장판", "필름난방", "기타바닥재"};
    private String[] sub050810 = {"소분류 사용안함", "합지벽지", "실크벽지", "뮤럴벽지", "포인트벽지", "띠벽지", "기타벽지"};
    private String[] sub050811 = {"소분류 사용안함", "타일시트지", "무늬목시트지", "단색시트지", "포인트시트지", "아이방시트지", "뮤럴시트지", "유리용시트지"};
    private String[] sub050806 = {"소분류 사용안함", "스텐타일", "아트타일", "우드타일", "유리타일", "자기질타일", "접착식타일", "카페트타일", "도기질타일"};
    private String[] sub050201 = {"소분류 사용안함", "가죽소파", "인조가죽소파", "패브릭소파", "리클라이너소파", "좌식소파", "소파베드", "벤치소파", "수납소파", "빈백", "흙/돌소파"};
    private String[] sub050202 = {"소분류 사용안함", "거실테이블", "사이드테이블", "접이식테이블"};
    private String[] sub050605 = {"소분류 사용안함", "사무용책상", "사무용책장", "사무용소파", "사무용의자", "사무용수납가구", "파티션", "캐비닛", "회의테이블", "교구용가구/소품", "학원/학교책걸상", "기타사무/교구용가구"};
    private String[] sub050602 = {"소분류 사용안함", "일반의자", "좌식의자", "스툴", "안락의자", "흔들의자", "하이팩의자", "간이/접이식의자", "의자발받침대", "인테리어의자", "목받침의자"};
    private String[] sub050601 = {"소분류 사용안함", "h형 책상", "일자형 책상", "좌식책상", "2인용 책상", "컴퓨터책상", "코너형책상", "독서실책상", "삼나무/원목책상", "책상소품", "스탠딩책상"};
    private String[] sub051202 = {"소분류 사용안함", "일반베개솜", "양모베개솜", "거위털/오리털베개솜", "마이크로화이바베개솜"};
    private String[] sub051203 = {"소분류 사용안함", "견면요솜", "목화요솜"};
    private String[] sub051201 = {"소분류 사용안함", "일반이불솜", "양모이불솜", "거위털/오리털이불솜", "마이크로화이바이불솜"};
    private String[] sub051601 = {"소분류 사용안함", "뜨개질실", "뜨개질바늘", "패키지", "완제품"};
    private String[] sub051602 = {"소분류 사용안함", "도안", "원단", "실/바늘", "패키지", "완제품"};
    private String[] sub051603 = {"소분류 사용안함", "도안", "원단", "패키지", "완제품"};
    private String[] sub050506 = {"소분류 사용안함", "일반침대", "벙커침대", "이단침대", "이층침대"};
    private String[] sub050922 = {"소분류 사용안함", "회화", "판화", "아트포스터", "사진작품", "공예디자인", "조각"};
    private String[] sub050901 = {"소분류 사용안함", "단스탠드", "장스탠드"};
    private String[] sub050903 = {"소분류 사용안함", "벽시계", "알람/탁상시계", "스탠드시계"};
    private String[] sub050905 = {"소분류 사용안함", "초/향초", "촛대/홀더", "아로마램프/오일", "아로마방향제/디퓨저", "기타아로마/캔들용품", "캔들만들기", "석고방향제만들기"};
    private String[] sub050904 = {"소분류 사용안함", "탁상용액자", "벽걸이액자", "파티션액자", "캐릭터액자", "퍼즐/그림/사진액자", "포토보드/집게", "액자세트"};
    private String[] sub050902 = {"소분류 사용안함", "벽등", "샹들리에", "거실조명", "야외조명", "분수등", "주방조명", "욕실조명", "현관조명", "인테리어조명", "전구", "형광등", "LED모듈"};
    private String[] sub050301 = {"소분류 사용안함", "식탁세트", "식탁테이블", "아일랜드식탁", "레인지대겸용식탁", "식탁의자", "아일랜드식탁의자"};
    private String[] sub051001 = {"소분류 사용안함", "싱글/슈퍼싱글침대커버", "더블/퀸/킹침대커버", "싱글/슈퍼싱글매트커버", "더블/퀸/킹매트커버"};
    private String[] sub051002 = {"소분류 사용안함", "계절베개", "라텍스베개", "메모리폼베개", "베개커버", "베개커버세트"};
    private String[] sub051007 = {"소분류 사용안함", "요세트", "요커버"};
    private String[] sub051006 = {"소분류 사용안함", "싱글/슈퍼싱글패드", "더블/퀸/킹패드"};
    private String[] sub051103 = {"소분류 사용안함", "싱글매트커버세트", "슈퍼싱글매트커버세트", "더블/퀸매트커버세트", "킹매트커버세트"};
    private String[] sub051101 = {"소분류 사용안함", "1인용", "2/3인용"};
    private String[] sub051104 = {"소분류 사용안함", "싱글이불베개세트", "슈퍼싱글이불베개세트", "더블/퀸이불베개세트", "킹이불베개세트"};
    private String[] sub051105 = {"소분류 사용안함", "싱글이불패드세트", "슈퍼싱글이불패드세트", "더블/퀸이불패드세트", "킹이불패드세트"};
    private String[] sub051102 = {"소분류 사용안함", "싱글침대커버세트", "슈퍼싱글침대커버세트", "더블/퀸침대커버세트", "킹침대커버세트"};
    private String[] sub050105 = {"소분류 사용안함", "벽걸이거울", "전신거울", "탁상거울", "손거울"};
    private String[] sub050102 = {"소분류 사용안함", "싱글매트리스", "슈퍼싱글매트리스", "더블매트리스", "퀸매트리스", "킹매트리스"};
    private String[] sub050103 = {"소분류 사용안함", "옷장", "장롱", "붙박이장", "틈새옷장", "드레스룸"};
    private String[] sub050101 = {"소분류 사용안함", "싱글침대", "슈퍼싱글침대", "더블침대", "퀸침대", "킹침대", "침대프레임", "이층침대", "이단침대", "접이식침대", "돌침대", "흙침대", "베드벤치", "패밀리침대", "모션베드"};
    private String[] sub050104 = {"소분류 사용안함", "일반화장대", "콘솔", "좌식화장대", "화장품정리함", "화장대의자"};
    private String[] sub051301 = {"소분류 사용안함", "면/극세사카페트", "파일카페트", "원목/우드카페트"};
    private String[] sub051401 = {"소분류 사용안함", "거실용커튼", "창문용커튼", "커튼링/봉"};
    private String[] sub051502 = {"소분류 사용안함", "식탁보", "식탁보세트", "식탁매트", "의자커버", "러너", "앞치마", "주방장갑", "기타주방데코"};
    private String[] sub051501 = {"소분류 사용안함", "소파커버/패드", "에어컨커버", "피아노커버", "기타커버류"};
    private String[] sub051503 = {"소분류 사용안함", "일반방석", "계절방석", "기능성방석", "방석커버", "일반쿠션", "기능성쿠션", "등쿠션", "대쿠션/대방석", "헤드쿠션", "목쿠션/아이필로우", "바디필로우", "팔꿈치/손목쿠션", "쿠션커버", "쿠션/방석커버세트", "쿠션/방석기타"};
    private String[] sub121301 = {"소분류 사용안함", "결혼", "부부관계", "가족관계"};
    private String[] sub121305 = {"소분류 사용안함", "테마별요리", "나라별요리", "홈베이킹/베이커리", "차/술/음료"};
    private String[] sub121306 = {"소분류 사용안함", "육아법", "육아일기"};
    private String[] sub121304 = {"소분류 사용안함", "정원가꾸기", "인테리어", "생활의 지혜", "가구/DIY"};
    private String[] sub121302 = {"소분류 사용안함", "임신/출산", "태교"};
    private String[] sub121303 = {"소분류 사용안함", "독서교육", "영어교육", "자녀교육일반", "좋은부모 되기"};
    private String[] sub122201 = {"소분류 사용안함", "건강정보/이야기", "질병치료/예방", "다이어트/미용", "요가/헬스", "달리기/마라톤", "건강운동 기타", "의학/식품/생활과학"};
    private String[] sub122202 = {"소분류 사용안함", "뜨개질/퀼트/십자수", "비즈/구슬공예", "선물포장/리본공예", "옷만들기", "꽃꽂이", "퍼즐/스도쿠", "바둑/장기", "반려동물", "사진/비디오", "취미기타", "골프", "등산", "낚시", "레저/스포츠기타"};
    private String[] sub120302 = {"소분류 사용안함", "경영일반/이론", "경영전략/혁신", "경영실무", "창업/장사"};
    private String[] sub120301 = {"소분류 사용안함", "경제사상/이론", "경제전망", "국제경제", "금융/재정/화폐", "쉽게읽는 경제", "한국경제"};
    private String[] sub120303 = {"소분류 사용안함", "광고/홍보", "마케팅일반", "마케팅전략", "영업/세일즈", "트렌드/미래예측"};
    private String[] sub120304 = {"소분류 사용안함", "부동산/경매", "재테크일반", "주식/증권"};
    private String[] sub121501 = {"소분류 사용안함", "국어의이해", "국어학이론", "외국인을 위한 한국어", "한국어수험서", "국어사전"};
    private String[] sub121505 = {"소분류 사용안함", "독일어", "러시아어", "스페인어", "프랑스어", "기타외국어"};
    private String[] sub121502 = {"소분류 사용안함", "영어학습일반", "회화/청취", "문법/독해/작문", "비즈니스영어", "유학영어", "수험영어", "번역/통역", "한영/영한/영영사전"};
    private String[] sub121503 = {"소분류 사용안함", "일본어일반", "회화/청취", "문법/독해/작문", "일본어능력시험/JPT", "일한/한일사전"};
    private String[] sub121504 = {"소분류 사용안함", "중국어일반", "회화/청취", "문법/독해/작문", "HSK", "중한/한중사전"};
    private String[] sub120709 = {"소분류 사용안함", "교육학의 이해", "교육학일반"};
    private String[] sub120703 = {"소분류 사용안함", "국방/군사 일반", "전쟁"};
    private String[] sub120704 = {"소분류 사용안함", "헌법", "국제법", "민법/형법/상법", "법학일반", "소송/판례", "기타법/법률"};
    private String[] sub120706 = {"소분류 사용안함", "노인복지", "사회문제일반", "사회복지이론", "아동복지", "여성복지", "장애인복지"};
    private String[] sub120705 = {"소분류 사용안함", "각국사회/문화", "사회이론/사상", "사회학일반"};
    private String[] sub120707 = {"소분류 사용안함", "신문/방송/출판", "언론이론", "언론일반"};
    private String[] sub120701 = {"소분류 사용안함", "정치일반", "각국정치", "외교/국제관계"};
    private String[] sub120702 = {"소분류 사용안함", "정책/지방자치", "행정일반/관리", "행정학일반"};
    private String[] sub120102 = {"소분류 사용안함", "한국고전소설", "세계고전", "세계문학"};
    private String[] sub120107 = {"소분류 사용안함", "문학의 이해", "문학이론", "문학사", "문학비평/평론"};
    private String[] sub120101 = {"소분류 사용안함", "영미소설", "일본소설", "중국소설", "러시아소설", "프랑스소설", "독일소설", "기타 국가 소설"};
    private String[] sub120106 = {"소분류 사용안함", "한국시", "외국시"};
    private String[] sub120108 = {"소분류 사용안함", "그리스로마신화", "서양", "동양", "한국"};
    private String[] sub120103 = {"소분류 사용안함", "공포/스릴러", "로맨스", "무협", "전쟁/역사", "추리/미스터리", "SF/판타지", "라이트노벨"};
    private String[] sub120104 = {"소분류 사용안함", "가족/성장문학", "어른을 위한 동화/우화", "영화/드라마 원작", "웹소설", "드라마극본"};
    private String[] sub121804 = {"소분류 사용안함", "고입 검정고시", "대입 검정고시", "중입 검정고시"};
    private String[] sub121806 = {"소분류 사용안함", "투자상담사", "물류/유통/품질관리사"};
    private String[] sub121803 = {"소분류 사용안함", "기술고시", "사법고시", "의사고시", "행정/외무고시", "기타", "감정평가사", "공인회계사/세무사", "법무사", "노무사"};
    private String[] sub121802 = {"소분류 사용안함", "10급 기능직", "9급 공무원", "7급 공무원", "경찰직", "군무원", "기술직", "법원직", "세무직", "소방직", "지하철/철도청", "기타"};
    private String[] sub121807 = {"소분류 사용안함", "주택관리사", "공인중개사"};
    private String[] sub121808 = {"소분류 사용안함", "변리사", "사회복지사"};
    private String[] sub121801 = {"소분류 사용안함", "LEET", "MEET/DEET", "PSAT", "상식", "적성검사/SSAT", "취업전략/면접", "기타 자격증"};
    private String[] sub121811 = {"소분류 사용안함", "정보처리", "컴퓨터활용능력", "워드프로세스", "기타"};
    private String[] sub121204 = {"소분류 사용안함", "첫걸음", "게임으로 배우기", "영어학습교재", "영어리딩/읽기", "어린이 외국어 기타"};
    private String[] sub121201 = {"소분류 사용안함", "교양/취미", "어린이동화", "학습/학습만화"};
    private String[] sub121202 = {"소분류 사용안함", "교양/취미", "어린이동화", "학습/학습만화"};
    private String[] sub121203 = {"소분류 사용안함", "교양/취미", "어린이동화", "학습/학습만화"};
    private String[] sub120210 = {"소분류 사용안함", "미학/예술 에세이", "미술 에세이", "음악 에세이"};
    private String[] sub121401 = {"소분류 사용안함", "강원/영동", "경상도/영남", "서울/경기", "전국여행", "전라도/호남", "제주도", "충청도"};
    private String[] sub121404 = {"소분류 사용안함", "국내지도", "해외지도", "지리일반/지리학"};
    private String[] sub121403 = {"소분류 사용안함", "맛집여행", "배낭여행", "역사/문학기행", "체험학습/가족여행", "기타"};
    private String[] sub121402 = {"소분류 사용안함", "미국/캐나다/중남미", "세계여행", "유럽여행", "인도/아시아여행", "일본여행", "중국여행", "기타여행"};
    private String[] sub120604 = {"소분류 사용안함", "국가별 역사/문화", "동양사/문화"};
    private String[] sub120603 = {"소분류 사용안함", "서양사/문화", "국가별 역사/문화"};
    private String[] sub120602 = {"소분류 사용안함", "세계사/문화", "시대별 역사/문화"};
    private String[] sub120601 = {"소분류 사용안함", "역사의 이해", "역사학 이론/비평", "문화사"};
    private String[] sub120605 = {"소분류 사용안함", "고중세사", "근현대사", "한국문화", "한국사일반", "한국역사인물"};
    private String[] sub120908 = {"소분류 사용안함", "미디어/광고"};
    private String[] sub120904 = {"소분류 사용안함", "건축가", "건축이론/건축사", "건축이야기"};
    private String[] sub120905 = {"소분류 사용안함", "만화 일반", "만화 작법/기법", "애니메이션 일반"};
    private String[] sub120902 = {"소분류 사용안함", "공예/서예", "디자인", "미술론/미술사", "미술실기/기법"};
    private String[] sub120906 = {"소분류 사용안함", "사진이론과 실기", "사진일반", "사진작가/사진집"};
    private String[] sub120907 = {"소분류 사용안함", "연극사/연극이론", "연극이론/비평", "연극일반", "영화사/영화이론", "영화제작/비평", "시나리오/희곡 작법"};
    private String[] sub120901 = {"소분류 사용안함", "미학/예술철학", "예술론/예술사", "예술사전/잡지", "문화비평"};
    private String[] sub120903 = {"소분류 사용안함", "악기/악보집", "음악이론/음악사", "장르별음악"};
    private String[] sub122115 = {"소분류 사용안함", "철학/심리/역사", "종교/명상", "사회/정치/법"};
    private String[] sub121101 = {"소분류 사용안함", "놀이책", "한국그림책", "외국그림책", "생활습관", "학습그림책"};
    private String[] sub121102 = {"소분류 사용안함", "놀이책", "한국그림책", "외국그림책", "생활습관", "학습그림책"};
    private String[] sub121104 = {"소분류 사용안함", "국내 창작 동화", "한국 전래 동화", "세계 명작 동화", "다른나라 그림책"};
    private String[] sub121103 = {"소분류 사용안함", "입체/팝업북", "스티커북/색칠놀이", "퍼즐/플래시카드", "기타"};
    private String[] sub121105 = {"소분류 사용안함", "동요/동시", "한글/말 배우기", "영어/숫자 배우기", "자연/과학", "기타"};
    private String[] sub121106 = {"소분류 사용안함", "사운드북", "스티커북/색칠북", "기타"};
    private String[] sub120502 = {"소분류 사용안함", "교양심리", "심리학일반"};
    private String[] sub120504 = {"소분류 사용안함", "언어학", "기호학"};
    private String[] sub120501 = {"소분류 사용안함", "교양인문", "독서/글쓰기", "인문학이론"};
    private String[] sub120505 = {"소분류 사용안함", "종교비평/비교종교학", "종교사", "종교학의이해", "신화의 이해"};
    private String[] sub120503 = {"소분류 사용안함", "한국철학", "교양철학", "동양철학", "서양철학", "철학일반"};
    private String[] sub120810 = {"소분류 사용안함", "쉽게 읽는 과학", "과학기본서"};
    private String[] sub122011 = {"소분류 사용안함", "시사/사회", "경제/경영"};
    private String[] sub122010 = {"소분류 사용안함", "리빙/인테리어", "결혼/육아"};
    private String[] sub122001 = {"소분류 사용안함", "교양", "문예", "출판"};
    private String[] sub122004 = {"소분류 사용안함", "중고학습", "어학", "아동학습", "방송교재", "행정/고시/정치"};
    private String[] sub122006 = {"소분류 사용안함", "레저/스포츠", "바둑/낚시/등산", "여행", "기타"};
    private String[] sub122005 = {"소분류 사용안함", "영화/공연", "방송/연예", "기타"};
    private String[] sub122013 = {"소분류 사용안함", "사진", "음악/미술"};
    private String[] sub122007 = {"소분류 사용안함", "예술/건축/디자인", "연예/영화/만화", "패션/리빙", "경제/시사", "기타잡지"};
    private String[] sub122002 = {"소분류 사용안함", "기계/자동차", "농학/원예", "의학/건강", "자연과학", "기타"};
    private String[] sub122003 = {"소분류 사용안함", "게임", "그래픽", "웹", "컴퓨터"};
    private String[] sub121707 = {"소분류 사용안함", "중고등학교 학습문학", "면접 가이드", "논술 가이드"};
    private String[] sub121601 = {"소분류 사용안함", "그래픽일반/자료집", "그래픽툴/저작툴", "3DS/MAX", "기타"};
    private String[] sub121602 = {"소분류 사용안함", "MS Excel", "MS PowerPoint", "MS Word", "기타"};
    private String[] sub042402 = {"소분류 사용안함", "데스크탑용", "노트북용"};
    private String[] sub042403 = {"소분류 사용안함", "AMD계열", "NVIDIA계열", "기타계열", "그래픽카드주변기기"};
    private String[] sub042404 = {"소분류 사용안함", "인텔CPU용", "AMDCPU용", "기타메인보드"};
    private String[] sub042408 = {"소분류 사용안함", "1394카드", "RAID카드", "SATA카드", "SCSI카드", "USB카드", "기타인터페이스카드"};
    private String[] sub042409 = {"소분류 사용안함", "CPU쿨러", "HDD쿨러", "그래픽카드쿨러", "노트북쿨러", "방열판", "수냉쿨러", "케이스쿨러", "기타쿨러"};
    private String[] sub042410 = {"소분류 사용안함", "브라켓", "팬/온도컨트롤러", "팬그릴", "팬필터", "조명기기", "방음방진", "기타튜닝용품"};
    private String[] sub042406 = {"소분류 사용안함", "ATX파워", "mATX파워", "TFX파워", "UPS", "기타PC용파워", "서버용파워"};
    private String[] sub041601 = {"소분류 사용안함", "USB허브", "USB라이트", "USB보온제품", "USB잠금장치", "USB청소기", "USB토이", "기타USB액세서리"};
    private String[] sub041405 = {"소분류 사용안함", "조이스틱/컨트롤러", "가방/케이스", "보호필름/스킨", "충전기기", "음향기기", "기타주변기기"};
    private String[] sub041113 = {"소분류 사용안함", "자연식가습기", "가열식가습기", "초음파식가습기", "복합식가습기", "가습기필터", "USB가습기"};
    private String[] sub041114 = {"소분류 사용안함", "공기청정기", "산림욕기", "환풍기", "공기정화기필터", "에어워셔", "기타부속품"};
    private String[] sub041115 = {"소분류 사용안함", "일반용냉풍기", "업소용냉풍기"};
    private String[] sub041104 = {"소분류 사용안함", "가스보일러", "석유보일러", "전기보일러", "연탄/화목보일러", "보일러부품"};
    private String[] sub041116 = {"소분류 사용안함", "스탠드형선풍기", "벽걸이형선풍기", "탁상형선풍기", "타워형선풍기", "천장형선풍기", "휴대용선풍기", "업소용선풍기", "선풍기부속품", "서큘레이터"};
    private String[] sub041110 = {"소분류 사용안함", "스탠드형에어컨", "벽걸이형에어컨", "멀티형에어컨", "창문형에어컨", "업소형에어컨", "시스템에어컨", "이동식에어컨", "천장형에어컨"};
    private String[] sub041117 = {"소분류 사용안함", "에어컨 리모콘", "에어컨 실외기", "기타액세서리"};
    private String[] sub041105 = {"소분류 사용안함", "전기온수기", "가스온수기"};
    private String[] sub041103 = {"소분류 사용안함", "전기온풍기", "가스온풍기", "석유온풍기", "돈풍기"};
    private String[] sub041101 = {"소분류 사용안함", "황토매트", "카페트매트", "옥매트", "기타전기매트", "전기장판"};
    private String[] sub041102 = {"소분류 사용안함", "전기담요", "전기방석", "전기요"};
    private String[] sub041111 = {"소분류 사용안함", "일반용제습기", "업소용제습기"};
    private String[] sub041119 = {"소분류 사용안함", "전기히터", "석유히터", "가스히터", "연탄/화목난로"};
    private String[] sub042501 = {"소분류 사용안함", "유선공유기", "유무선공유기", "무선AP"};
    private String[] sub042502 = {"소분류 사용안함", "무선랜카드", "유선랜카드"};
    private String[] sub040203 = {"소분류 사용안함", "액정보호필름", "전신보호필름"};
    private String[] sub042202 = {"소분류 사용안함", "DVR본체", "DVR카드", "DVR패키지"};
    private String[] sub042204 = {"소분류 사용안함", "2채널", "2.1채널", "5.1채널"};
    private String[] sub042209 = {"소분류 사용안함", "내장형", "외장형", "레코딩장비", "기타사운드카드용품"};
    private String[] sub042208 = {"소분류 사용안함", "TV카드", "PC리모컨", "안테나", "DMB수신기"};
    private String[] sub042210 = {"소분류 사용안함", "디코더", "엔코더", "방송보드", "영상편집"};
    private String[] sub040702 = {"소분류 사용안함", "의류건조기", "신발건조기", "탈수기"};
    private String[] sub040710 = {"소분류 사용안함", "전동칫솔", "전동칫솔모", "구강세정기", "칫솔살균기"};
    private String[] sub040704 = {"소분류 사용안함", "스팀다리미", "건식다리미"};
    private String[] sub040705 = {"소분류 사용안함", "보조키형", "주키형"};
    private String[] sub040706 = {"소분류 사용안함", "생활용무전기", "업무용무전기", "무전기액세서리"};
    private String[] sub040701 = {"소분류 사용안함", "일반세탁기", "드럼세탁기", "미니세탁기", "세탁기부품"};
    private String[] sub040707 = {"소분류 사용안함", "LED스탠드", "삼파장스탠드", "오파장스탠드", "칠파장스탠드", "일반스탠드"};
    private String[] sub040709 = {"소분류 사용안함", "유선전화기", "무선전화기", "유무선전화기", "사무용전화기", "전화기주변기기"};
    private String[] sub040703 = {"소분류 사용안함", "유선청소기", "무선청소기", "스팀청소기", "로봇청소기", "침구청소기", "물걸레청소기", "업소용청소기", "청소기액세서리", "고압세척기"};
    private String[] sub040501 = {"소분류 사용안함", "LEDTV", "OLEDTV", "LCDTV", "PDPTV", "브라운관TV", "QLEDTV"};
    private String[] sub040502 = {"소분류 사용안함", "3D입체안경", "셀렉터/분배기", "AV젠더", "AV케이블", "리모컨", "브라켓", "방진용품", "스탠드", "안테나", "TV셋톱박스", "TV전용키보드", "TV카메라", "기타액세서리"};
    private String[] sub040505 = {"소분류 사용안함", "퍼스널뷰어", "블루레이플레이어", "DVD플레이어", "DVD레코더", "DVD콤보", "포터블DVD"};
    private String[] sub040503 = {"소분류 사용안함", "DLP", "LCD", "LCoS/기타"};
    private String[] sub040504 = {"소분류 사용안함", "프로젝터스크린", "프로젝터램프", "기타프로젝터주변기기"};
    private String[] sub040619 = {"소분류 사용안함", "배터리", "보호필름", "충전기", "케이스", "기타 MP3/PMP액세서리"};
    private String[] sub040603 = {"소분류 사용안함", "일반마이크", "무선마이크", "전문가용마이크", "확성기", "마이크주변기기"};
    private String[] sub040620 = {"소분류 사용안함", "블루투스이어폰/이어셋", "블루투스헤드폰/헤드셋", "블루투스동글"};
    private String[] sub040610 = {"소분류 사용안함", "스피커단품", "스피커세트", "블루투스스피커", "스피커액세서리"};
    private String[] sub040602 = {"소분류 사용안함", "휴대폰도킹스피커/오디오", "일체형오디오", "분리형오디오", "오디오액세서리"};
    private String[] sub040623 = {"소분류 사용안함", "케이스/파우치", "캡/솜/팁", "거치대", "연장선/케이블", "정리기", "기타이어폰/헤드폰액세서리"};
    private String[] sub040613 = {"소분류 사용안함", "워크맨", "일반카세트", "CD카세트", "카세트플레이어액세서리"};
    private String[] sub040601 = {"소분류 사용안함", "단일형홈시어터", "사운드바시스템", "조합형홈시어터"};
    private String[] sub040801 = {"소분류 사용안함", "남성용면도기", "여성용면도기"};
    private String[] sub040802 = {"소분류 사용안함", "면도날/망", "세정액", "기타면도기소모품"};
    private String[] sub041002 = {"소분류 사용안함", "내비게이션", "내비게이션액세서리", "HUD"};
    private String[] sub041009 = {"소분류 사용안함", "방음/방진/흡음", "방청용품", "실내원단"};
    private String[] sub041001 = {"소분류 사용안함", "블랙박스", "블랙박스액세서리"};
    private String[] sub041010 = {"소분류 사용안함", "노이즈필터", "레벨미터", "서랍장", "전원보강용품", "리모컨", "기타자동차AV용품"};
    private String[] sub041005 = {"소분류 사용안함", "인대쉬형", "거치형", "천장형", "헤드레스트형", "기타차량용TV/모니터"};
    private String[] sub041004 = {"소분류 사용안함", "후방카메라", "후방감지기", "전방카메라", "전방감지기", "이동식카메라감지기"};
    private String[] sub041006 = {"소분류 사용안함", "스피커", "우퍼", "앰프", "음향기기기타"};
    private String[] sub041007 = {"소분류 사용안함", "무선", "유선"};
    private String[] sub041003 = {"소분류 사용안함", "하이패스", "차량용GPS", "하이패스액세서리"};
    private String[] sub041008 = {"소분류 사용안함", "CD/MP3플레이어", "DVD플레이어", "CD/DVD체인저", "헤드유닛패키지"};
    private String[] sub042308 = {"소분류 사용안함", "CD미디어", "DVD미디어", "블루레이미디어", "기타공미디어", "미디어보관함", "미디어전용라벨", "기타공미디어액세서리"};
    private String[] sub040905 = {"소분류 사용안함", "일반가스레인지", "빌트인가스레인지", "업소용가스레인지"};
    private String[] sub040902 = {"소분류 사용안함", "스탠드형", "뚜껑형", "서랍형", "업소용"};
    private String[] sub040901 = {"소분류 사용안함", "양문형냉장고", "일반형냉장고", "업소용냉장고"};
    private String[] sub040914 = {"소분류 사용안함", "식기세척기", "식기건조기", "업소용식기세척기", "업소용식기건조기", "과일야채세척기"};
    private String[] sub040909 = {"소분류 사용안함", "전기오븐", "오븐레인지", "오븐조리기", "복합형오븐"};
    private String[] sub040907 = {"소분류 사용안함", "압력밥솥", "일반밥솥", "업소용밥솥"};
    private String[] sub040937 = {"소분류 사용안함", "슬로우쿠커", "전기냄비", "전기찜기", "에그마스터"};
    private String[] sub040915 = {"소분류 사용안함", "무선포트", "라면포트", "보온포트", "유선포트", "전기물통"};
    private String[] sub040904 = {"소분류 사용안함", "반찬냉장고", "쌀냉장고", "와인냉장고", "제빙기", "화장품냉장고", "쇼케이스", "육수냉장고"};
    private String[] sub040916 = {"소분류 사용안함", "냉정수기", "냉온정수기", "냉온수기", "미니정수기", "정수기필터", "기타정수기주변기기"};
    private String[] sub040917 = {"소분류 사용안함", "에스프레소머신", "업소용에스프레소머신", "캡슐/POD머신", "커피머신부속품"};
    private String[] sub040918 = {"소분류 사용안함", "팝업토스터기", "오븐토스터기"};
    private String[] sub042101 = {"소분류 사용안함", "무선마우스", "유선마우스", "트랙볼마우스", "펜마우스", "프리젠터"};
    private String[] sub042105 = {"소분류 사용안함", "잉크젯복합기", "컬러레이저복합기", "흑백레이저복합기"};
    private String[] sub042107 = {"소분류 사용안함", "잉크", "토너", "기타복합기/프린터소모품", "3D프린터 소모품"};
    private String[] sub042108 = {"소분류 사용안함", "명함스캐너", "바코드스캐너", "양면스캐너", "펜스캐너", "평판스캐너", "필름스캐너", "3D 스캐너"};
    private String[] sub042102 = {"소분류 사용안함", "무선키보드", "유선키보드", "키패드"};
    private String[] sub042104 = {"소분류 사용안함", "태블릿", "태블릿액세서리"};
    private String[] sub042106 = {"소분류 사용안함", "잉크젯프린터", "레이저프린터", "포토프린터", "도트프린터", "라벨프린터", "바코드프린터", "영수증프린터", "플로터", "3D프린터", "카드프린터"};
    private String[] sub040416 = {"소분류 사용안함", "LCD보호필름", "LCD보호커버", "LCD후드", "외부보호필름/스티커"};
    private String[] sub040406 = {"소분류 사용안함", "렌즈필터", "렌즈어댑터", "렌즈캡", "렌즈후드", "텔레컨버터", "렌즈/필터케이스", "핀홀/기타렌즈용품"};
    private String[] sub040409 = {"소분류 사용안함", "MicroSD메모리", "SD메모리", "CF메모리", "메모리스틱", "XQD메모리", "기타메모리"};
    private String[] sub040413 = {"소분류 사용안함", "삼각대", "모노포드", "헤드", "플레이트/퀵슈", "삼각대가방/스트랩", "삼각대액세서리"};
    private String[] sub040407 = {"소분류 사용안함", "즉석카메라", "즉석필름", "즉석카메라액세서리"};
    private String[] sub040415 = {"소분류 사용안함", "전용정품충전기", "전용호환충전기", "전용정품배터리", "전용호환배터리", "배터리그립", "범용충전기", "범용충전지"};
    private String[] sub040410 = {"소분류 사용안함", "멀티리더기", "전용리더기", "메모리어댑터"};
    private String[] sub040418 = {"소분류 사용안함", "리모컨/릴리즈", "수평계", "촬영보조용품", "GPS/무선송수신", "카메라/캠코더용마이크", "아이피스", "파인더", "포커싱스크린", "핫슈커버", "라이트박스", "루페", "소프트버튼", "카메라제습용품", "카메라보관함", "청소용품", "기타카메라/캠코더용품"};
    private String[] sub040411 = {"소분류 사용안함", "전용케이스", "일반형가방", "배낭형케이스", "방수케이스", "기타카메라가방/케이스", "가방용품"};
    private String[] sub040405 = {"소분류 사용안함", "표준렌즈", "광각렌즈", "망원렌즈", "어안렌즈", "컨버젼렌즈"};
    private String[] sub040412 = {"소분류 사용안함", "핸드스트랩", "넥스트랩", "핸드그립"};
    private String[] sub040414 = {"소분류 사용안함", "플래시", "라이트", "조명/노출용품"};
    private String[] sub040417 = {"소분류 사용안함", "35mm필름", "중형필름", "암실/현상용품", "기타필름/관련용품"};
    private String[] sub040408 = {"소분류 사용안함", "SLR카메라", "자동카메라", "로모카메라", "토이카메라", "일회용카메라"};
    private String[] sub041803 = {"소분류 사용안함", "액정보호필름", "전신보호필름"};
    private String[] sub041306 = {"소분류 사용안함", "케이스/파우치", "보호필름/키스킨", "충전기/케이블"};
    private String[] sub040304 = {"소분류 사용안함", "전용배터리", "보조배터리"};
    private String[] sub040302 = {"소분류 사용안함", "액정보호필름", "전신보호필름", "휴대폰스킨", "홈버튼스티커", "액정코팅제"};
    private String[] sub040303 = {"소분류 사용안함", "충전기", "크래들"};
    private String[] sub040301 = {"소분류 사용안함", "가죽케이스", "실리콘케이스", "플라스틱케이스", "메탈케이스", "기타케이스", "암밴드"};
    private String[] sub110301 = {"소분류 사용안함", "정장시계", "캐주얼시계", "아동시계"};
    private String[] sub110604 = {"소분류 사용안함", "MP3/PMP", "전자사전", "이어폰", "헤드폰"};
    private String[] sub110603 = {"소분류 사용안함", "면도기", "이미용가전", "전동칫솔", "기타가전제품"};
    private String[] sub110602 = {"소분류 사용안함", "카메라", "캠코더", "주변기기"};
    private String[] sub110501 = {"소분류 사용안함", "핸드백", "백팩", "여행용가방", "비지니스가방", "소품/기타"};
    private String[] sub110509 = {"소분류 사용안함", "남성용", "여성용"};
    private String[] sub110508 = {"소분류 사용안함", "남성용", "여성용"};
    private String[] sub110502 = {"소분류 사용안함", "장지갑", "중/반지갑", "카드/명함지갑", "열쇠지갑", "소품지갑"};
    private String[] sub110102 = {"소분류 사용안함", "베이스메이크업", "색조메이크업", "네일메이크업", "메이크업도구"};
    private String[] sub110101 = {"소분류 사용안함", "스킨/토너", "에센스", "로션", "크림", "미스트", "아이케어", "립케어", "마스크/팩", "스페셜케어", "페이스오일"};
    private String[] sub091002 = {"소분류 사용안함", "국내TV드라마", "해외TV드라마"};
    private String[] sub091001 = {"소분류 사용안함", "국내영화", "해외영화"};
    private String[] sub091401 = {"소분류 사용안함", "디지털체중계", "아날로그체중계"};
    private String[] sub090104 = {"소분류 사용안함", "대패", "샌더", "트리머", "조각기", "톱", "홀쏘"};
    private String[] sub090105 = {"소분류 사용안함", "배관용품", "컷터기", "확관기", "코어드릴", "파이프머신"};
    private String[] sub090111 = {"소분류 사용안함", "펌프", "모터", "발전기", "기타소형기계"};
    private String[] sub090102 = {"소분류 사용안함", "공구세트", "공구함", "니퍼", "도끼", "드라이버", "렌치", "망치", "몽키", "복스", "스패너", "타카", "타카핀", "펜치", "플라이어", "바이스", "핀셋", "작업대", "기타수작업공구"};
    private String[] sub090119 = {"소분류 사용안함", "보안경", "마스크", "소방용품", "소화기", "안전/작업복", "안전모", "안전장갑", "안전표시/신호", "비상/구난용품", "기타안전용품"};
    private String[] sub090110 = {"소분류 사용안함", "에어건", "에어렌치", "에어스프레이건", "에어타카", "에어호스/게이지", "컴프레서", "유압공구", "기타에어공구"};
    private String[] sub090108 = {"소분류 사용안함", "가스예초기", "엔진예초기", "충전/전기예초기", "예초기부품"};
    private String[] sub090107 = {"소분류 사용안함", "용접기", "용접봉", "용접용품", "인두기", "인두용품", "절단기", "해빙기"};
    private String[] sub090115 = {"소분류 사용안함", "사다리", "핸드카트/운반기", "지게차"};
    private String[] sub090109 = {"소분류 사용안함", "농기구", "압축분무기", "비료살포기", "원예가위", "잔디깎이", "호스/호스카트", "스프링클러", "기타원예공구", "농기계"};
    private String[] sub090112 = {"소분류 사용안함", "멀티탭", "일회용 건전지", "일회용 리튬건전지", "충전용 건전지/배터리", "기타 전기용품", "전선/케이블"};
    private String[] sub090101 = {"소분류 사용안함", "드릴세트", "비트세트", "청소기", "광택기", "송풍기", "열풍기", "전동공구액세서리", "전동드릴", "충전드릴", "해머드릴", "컷쏘", "기타전동공구"};
    private String[] sub090106 = {"소분류 사용안함", "각도/고속절단기", "그라인더", "그라인더날", "다용도조각기", "루터", "루터날", "직소기", "직소기날"};
    private String[] sub090117 = {"소분류 사용안함", "글루건", "세정제/클리너", "스프레이", "윤활유", "실리콘", "접착제", "시멘트/몰탈"};
    private String[] sub090118 = {"소분류 사용안함", "나사", "리벳", "못", "볼트/너트", "핀", "홀딩클램프", "스프링"};
    private String[] sub090103 = {"소분류 사용안함", "레이저측정기", "산업용저울", "수평기", "온도계/습도계", "염도계", "워킹자/줄자", "캘리퍼스", "테스트기", "방사능측정기", "조도계", "음주측정기", "흡연측정기", "산소포화도측정기", "기타측정기"};
    private String[] sub090113 = {"소분류 사용안함", "수성페인트", "유성페인트", "락카/스프레이페인트"};
    private String[] sub090114 = {"소분류 사용안함", "젯소", "바니시", "스테인", "에폭시", "붓", "롤러", "기타페인트용품", "방수제"};
    private String[] sub090116 = {"소분류 사용안함", "밴딩기", "택배박스", "택배봉투", "테이프", "커터", "리본", "포장지", "선물박스"};
    private String[] sub090202 = {"소분류 사용안함", "노트", "노트패드", "점착식메모지", "수첩", "메모지"};
    private String[] sub090203 = {"소분류 사용안함", "스케줄러/플래너", "다이어리", "캘린더/달력", "바인더", "속지/포켓", "가계부"};
    private String[] sub090206 = {"소분류 사용안함", "데스크패드", "독서대", "북엔드", "문진", "연필꽂이", "메모꽂이", "데스크정리함", "저금통", "문서보관함/서류함", "서류꽂이/서류받침대", "명함꽂이"};
    private String[] sub090213 = {"소분류 사용안함", "사무용가위", "사무용칼", "펀치", "모양펀치", "다이모/엠보서", "지우개", "수정용품", "자", "자석", "풀/접착제", "클립/핀", "집게", "스테이플러/침", "북마크", "문구세트", "기타문구용품"};
    private String[] sub090207 = {"소분류 사용안함", "네온보드", "메모판/미니보드", "블랙보드", "전자칠판", "칠판", "코르크/게시판", "화이트보드"};
    private String[] sub090209 = {"소분류 사용안함", "OHP", "공학용계산기", "일반계산기", "금고", "금전등록기", "동전계수기", "디지털복사기", "문서세단기", "수표발행기", "실물화상기", "재단기", "전자타자기", "접지기", "제본기", "지폐계수기", "천공기", "출퇴근기록기", "코팅기", "팩스", "RFID"};
    private String[] sub090217 = {"소분류 사용안함", "명패", "명찰", "현수막", "상패", "명함/전단지제작"};
    private String[] sub090212 = {"소분류 사용안함", "스탬프", "스탬프패드", "도장", "인주"};
    private String[] sub090211 = {"소분류 사용안함", "스티커", "네임스티커", "마스킹테이프", "테이프"};
    private String[] sub090204 = {"소분류 사용안함", "접착식앨범", "포켓식앨범", "포토박스", "폴라로이드앨범"};
    private String[] sub090208 = {"소분류 사용안함", "복사지", "견출지", "라벨지", "양식/서식지", "인화지/포토용지", "컬러복사지", "코팅지/필름지", "팩스용지/전산용지", "기타용지"};
    private String[] sub090205 = {"소분류 사용안함", "가면/머리띠", "데코용품", "야광용품", "식기/테이블용품", "폭죽/불꽃놀이", "고깔모자", "가랜드", "풍선/풍선용품", "태극기", "케이크토퍼"};
    private String[] sub090210 = {"소분류 사용안함", "제도용자", "제도용지", "제도용필기구", "제도판", "기타제도용품"};
    private String[] sub090215 = {"소분류 사용안함", "세계지도", "국내지도", "지구본"};
    private String[] sub090216 = {"소분류 사용안함", "카드", "편지지", "엽서", "봉투", "청첩장", "모바일초대장"};
    private String[] sub090214 = {"소분류 사용안함", "바인더", "파일", "파일속지", "서류철/결재판"};
    private String[] sub090201 = {"소분류 사용안함", "리필심", "만년필", "매직", "네임펜", "보드마카", "볼펜", "분필", "사인펜", "샤프", "샤프심", "연필", "연필깎이", "잉크", "펜", "필기구세트", "형광펜", "기타필기도구", "필통", "붓펜"};
    private String[] sub090807 = {"소분류 사용안함", "개껌", "육포/건조간식", "수제간식", "비스킷/스낵", "동결건조 간식", "캔/파우치", "트릿/스틱", "통살/소시지", "음료", "빵/케이크"};
    private String[] sub090809 = {"소분류 사용안함", "영양제", "눈/귀 관리용품", "강아지유산균", "치약", "칫솔", "구강청결제", "구강티슈"};
    private String[] sub090808 = {"소분류 사용안함", "배변패드", "배변판", "기저귀/팬티", "탈취제/소독제", "배변유도제", "배변봉투/집게"};
    private String[] sub090806 = {"소분류 사용안함", "건식사료", "소프트사료", "습식사료", "수제사료", "분유/우유", "동결건조 사료"};
    private String[] sub090811 = {"소분류 사용안함", "노즈워크", "장난감/토이", "공/원반", "훈련용품", "자동장난감"};
    private String[] sub090813 = {"소분류 사용안함", "캔/파우치", "수제간식", "육포/건조간식", "동결건조 간식", "트릿/스틱", "통살/소시지", "비스킷/스낵", "캣닢/캣그라스", "음료", "빵/케이크"};
    private String[] sub090815 = {"소분류 사용안함", "영양제", "고양이유산균", "구강관리용품", "눈/귀 관리용품"};
    private String[] sub090814 = {"소분류 사용안함", "응고형모래", "흡수형모래", "후드형화장실", "평판형화장실", "거름망형화장실", "배변패드", "탈취제/소독제", "매트/발판", "분변통/모래삽", "자동화장실"};
    private String[] sub090812 = {"소분류 사용안함", "건식사료", "습식사료", "수제사료", "분유/우유", "동결건조 사료"};
    private String[] sub090817 = {"소분류 사용안함", "낚시/막대", "토이/쿠션/공", "터널/주머니", "자동장난감", "스크래쳐", "레이저포인터"};
    private String[] sub090818 = {"소분류 사용안함", "쿠션/방석", "하우스", "매트", "계단/스텝", "안전문", "울타리", "넥카라", "침대/해먹"};
    private String[] sub090810 = {"소분류 사용안함", "샴푸/린스/비누", "에센스/향수/밤", "브러시/빗", "이발기", "미용가위", "발톱/발 관리", "드라이기/드라이룸", "타월/가운", "기타 미용/목욕용품", "물티슈/크리너", "샤워기/욕조"};
    private String[] sub090823 = {"소분류 사용안함", "장례용품", "파티용품"};
    private String[] sub090820 = {"소분류 사용안함", "식기/식탁", "자동급식기", "급수기/물병", "정수기/필터", "사료통/사료스푼"};
    private String[] sub090822 = {"소분류 사용안함", "목줄", "가슴줄", "목걸이/인식표", "리드줄"};
    private String[] sub090821 = {"소분류 사용안함", "이동장/이동가방", "유모차", "카시트"};
    private String[] sub090819 = {"소분류 사용안함", "패딩", "올인원", "티셔츠/후드", "한복", "기타액세서리", "플리스", "재킷/점퍼", "베스트/조끼", "원피스/드레스", "팬츠/스커트", "셔츠/블라우스", "니트/스웨터", "레인코트", "코스튬", "커플룩", "수영복/구명조끼", "스카프/목도리/케이프", "가방", "신발/양말", "안경/모자", "헤어핀/주얼리"};
    private String[] sub092902 = {"소분류 사용안함", "국내TV드라마", "해외TV드라마"};
    private String[] sub092901 = {"소분류 사용안함", "국내영화", "해외영화"};
    private String[] sub093309 = {"소분류 사용안함", "CCTV", "모형카메라", "자물쇠/열쇠", "도어락/안전고리", "경보기", "호신용품", "기타보안용품"};
    private String[] sub093302 = {"소분류 사용안함", "일반생리대", "체내형생리대"};
    private String[] sub093308 = {"소분류 사용안함", "돗자리/매트", "모기장", "문풍지", "단열시트", "방풍막/방풍비닐", "분무기", "쇼핑백", "핸드카트", "신발관리도구", "재떨이", "호출벨", "난방텐트"};
    private String[] sub093305 = {"소분류 사용안함", "일반섬유유연제", "고농축섬유유연제", "시트형섬유유연제"};
    private String[] sub093303 = {"소분류 사용안함", "산모용", "환자용", "요실금용", "위생매트"};
    private String[] sub093304 = {"소분류 사용안함", "일반주방세제", "식기세척기전용세제", "베이킹소다/구연산", "곰팡이제거제", "살균소독제", "배수구세정제", "변기세정제", "세탁조세정제", "에어컨세정제", "가습기세정제", "유리세정제", "광택제", "세탁세제", "빨래비누", "울세제", "홈드라이", "세탁보조제", "손소독제"};
    private String[] sub093306 = {"소분류 사용안함", "실내용방향제", "차량용방향제", "새집증후군/진드기", "섬유탈취스프레이", "실내탈취제", "옷장탈취제", "냉장/냉동고탈취제", "신발/신발장탈취제", "차량용탈취제", "제습제", "숯"};
    private String[] sub093307 = {"소분류 사용안함", "모기향", "에어졸/스프레이", "리퀴드", "매트형", "겔", "아로마/로션", "모기채/파리채", "끈끈이", "방충제"};
    private String[] sub093301 = {"소분류 사용안함", "갑티슈", "여행티슈", "냅킨", "롤화장지", "세정티슈", "점보롤", "키친타월", "페이퍼타월", "화장지세트", "화장지케이스"};
    private String[] sub091301 = {"소분류 사용안함", "이동접이식", "천장부착식"};
    private String[] sub093101 = {"소분류 사용안함", "벽걸이선반/진열대", "코너선반/진열대", "이동식선반/진열대", "스탠드선반/진열대"};
    private String[] sub093103 = {"소분류 사용안함", "일반옷걸이", "바지걸이"};
    private String[] sub093102 = {"소분류 사용안함", "속옷정리함", "부직포정리함", "종이정리함", "소품정리함", "신발정리대"};
    private String[] sub090506 = {"소분류 사용안함", "다트", "보드게임", "마술도구"};
    private String[] sub090508 = {"소분류 사용안함", "모형", "다이캐스트", "밀리터리", "프라모델", "프라모델용품", "피규어", "보관용품"};
    private String[] sub090509 = {"소분류 사용안함", "보트/배", "자동차", "탱크", "중장비", "헬기", "비행기", "RC소품", "드론"};
    private String[] sub090510 = {"소분류 사용안함", "보호장비", "서바이벌용품", "건(GUN)"};
    private String[] sub090515 = {"소분류 사용안함", "포토/브로마이드", "스티커", "문구사무용품", "텀블러/물병", "응원봉", "휴대폰용품", "기타굿즈"};
    private String[] sub090512 = {"소분류 사용안함", "우표", "씰"};
    private String[] sub090513 = {"소분류 사용안함", "도서"};
    private String[] sub090514 = {"소분류 사용안함", "의상", "소품"};
    private String[] sub090507 = {"소분류 사용안함", "퍼즐", "블록"};
    private String[] sub090511 = {"소분류 사용안함", "지폐", "주화"};
    private String[] sub091801 = {"소분류 사용안함", "스틸휠체어", "알루미늄휠체어", "전동휠체어"};
    private String[] sub090703 = {"소분류 사용안함", "멜로디언", "아코디언", "오르간", "실로폰", "키보드/신시사이저"};
    private String[] sub090705 = {"소분류 사용안함", "색소폰", "오카리나", "클라리넷", "트럼펫", "팬플루트", "플룻", "호른", "휘슬", "오보에", "피콜로", "바순", "트롬본", "튜바", "유포니움", "리코더", "관악기소품/부품"};
    private String[] sub090707 = {"소분류 사용안함", "가야금", "거문고", "꽹과리", "단소", "대금", "북", "소금", "장구", "징", "해금", "기타국악기", "국악기/소품/부품"};
    private String[] sub090701 = {"소분류 사용안함", "베이스기타", "어쿠스틱기타", "오베이션기타", "우쿨렐레", "일렉기타", "클래식기타"};
    private String[] sub090709 = {"소분류 사용안함", "핸드벨", "탬버린", "하모니카", "기타교육용악기"};
    private String[] sub090708 = {"소분류 사용안함", "메트로놈", "보면대", "스탠드", "앰프", "이펙터", "튜너기", "파워믹서"};
    private String[] sub090706 = {"소분류 사용안함", "드럼", "스틱/스탠드", "심벌즈", "전자드럼", "타악기소품/부품", "기타타악기"};
    private String[] sub090702 = {"소분류 사용안함", "그랜드피아노", "디지털피아노", "일반피아노", "피아노용품"};
    private String[] sub090704 = {"소분류 사용안함", "만돌린", "바이올린", "베이스", "비올라", "전자바이올린", "첼로", "하프", "기타현악기", "케이스", "활", "현악기소품/부품"};
    private String[] sub093005 = {"소분류 사용안함", "면도기", "면도기날"};
    private String[] sub093001 = {"소분류 사용안함", "전자식비데", "기계식비데", "렌탈비데", "비데필터"};
    private String[] sub093006 = {"소분류 사용안함", "샤워커튼/커튼봉", "목욕바구니", "샤워볼", "때타월/때장갑", "샤워용품", "샤워가운", "바디브러시"};
    private String[] sub093004 = {"소분류 사용안함", "샤워기", "샤워호스", "수도/수전용품", "녹물제거/샤워기필터", "배수구캡", "욕실부속품"};
    private String[] sub093007 = {"소분류 사용안함", "세면타월", "바스/비치타월", "주방수건"};
    private String[] sub093011 = {"소분류 사용안함", "미끄럼방지매트", "욕실발판/매트"};
    private String[] sub093010 = {"소분류 사용안함", "디스펜서", "칫솔통/걸이", "양치컵", "비눗갑/홀더/받침", "휴지걸이", "수건걸이", "치약짜개"};
    private String[] sub093003 = {"소분류 사용안함", "변기커버", "욕실세트", "욕실의자", "욕실화", "바가지", "세숫대야", "여행용세트"};
    private String[] sub093008 = {"소분류 사용안함", "욕실선반", "욕실수납장"};
    private String[] sub093009 = {"소분류 사용안함", "변기솔", "욕실청소도구", "뚫어뻥"};
    private String[] sub093002 = {"소분류 사용안함", "이동식욕조", "반신욕조", "욕조트레이/소품", "월풀욕조/매립욕조"};
    private String[] sub093012 = {"소분류 사용안함", "양변기", "세면대"};
    private String[] sub090405 = {"소분류 사용안함", "도색용품", "레진", "접착제", "보호필름", "시트지", "DIY전구", "LED소자", "릴레이", "스위치", "전기용품", "휴즈", "공구"};
    private String[] sub090409 = {"소분류 사용안함", "에어컨필터"};
    private String[] sub090406 = {"소분류 사용안함", "실내등", "안개등", "전조등", "테일램프", "방향지시등", "기타램프용품"};
    private String[] sub090408 = {"소분류 사용안함", "배터리충전기", "점프선", "터미널", "기타배터리용품"};
    private String[] sub090410 = {"소분류 사용안함", "광택기", "컴프레셔", "호스", "먼지털이개", "브러시", "세차도구세트", "세차물통", "세차장갑", "스펀지", "타월/융", "가죽클리너", "광택코팅제", "세차패키지", "카샴푸", "타이어세정광택제", "휠세정광택제", "스티커제거제/타르제거제", "엔진룸세척", "유리코팅제", "유리세정제", "유리복원제", "김서림방지제", "정전기방지", "차량용커버", "컴파운드"};
    private String[] sub090417 = {"소분류 사용안함", "CD바이저", "논슬립패드", "선글라스클립", "옷걸이/후크/행거", "콘솔박스", "트렁크정리함", "포켓", "홀더", "휴지통", "우산걸이", "테이블"};
    private String[] sub090413 = {"소분류 사용안함", "미션오일", "미션오일첨가제", "부동액", "브레이크오일", "엔진오일첨가제", "연료첨가제", "오일세트", "오일필터", "엔진오일", "연비향상오일", "기타오일용품"};
    private String[] sub090414 = {"소분류 사용안함", "스티커", "엠블럼", "가드", "몰딩", "사이드미러", "후사경", "선루프", "선바이저", "에어로파츠", "와이퍼", "워셔액", "도어스커프", "번호판볼트", "사이드스텝", "안테나볼", "폴대", "후드핀", "캐리어", "루프박스"};
    private String[] sub090415 = {"소분류 사용안함", "기어용품", "대시보드커버", "룸미러", "룸미러커버", "보조룸미러", "몰딩", "썬팅필름", "안전벨트", "차량용나침반", "차량용시계", "차량용장식소품", "차량용재떨이", "차량용사진액자", "페달용품", "핸들", "핸들커버", "햇빛가리개", "주차번호판"};
    private String[] sub090416 = {"소분류 사용안함", "소켓/시거잭", "인버터", "전류전압안정기", "접지케이블", "차량용태양열충전기", "차량용AC어댑터", "컨버터"};
    private String[] sub090407 = {"소분류 사용안함", "바닥매트", "목쿠션", "등쿠션", "팔/틈새쿠션", "방석"};
    private String[] sub090411 = {"소분류 사용안함", "시동경보기", "스마트키", "스킨", "스타트버튼", "키노브", "키케이스", "폴딩키"};
    private String[] sub090419 = {"소분류 사용안함", "휠", "휠용품", "타이어", "타이어용품"};
    private String[] sub090420 = {"소분류 사용안함", "냉각", "배기/흡기튜닝", "브레이크", "서스펜션", "엔진튠업", "점화케이블", "점화플러그", "계기판", "게이지", "혼", "레이싱용품", "기타튜닝용품"};
    private String[] sub090412 = {"소분류 사용안함", "차량용가습기", "차량용공기청정기", "차량용냉/온장고", "차량용면도기", "차량용보온컵", "차량용선풍기", "차량용온풍기", "차량용청소기"};
    private String[] sub090418 = {"소분류 사용안함", "차량용휴대폰거치대", "차량용휴대폰충전기"};
    private String[] sub091209 = {"소분류 사용안함", "교자상", "다과상", "다용도상", "상커버"};
    private String[] sub091204 = {"소분류 사용안함", "곰솥/들통", "냄비부자재", "냄비세트", "돌솥", "뚝배기", "압력솥", "양수냄비", "전골냄비", "전자레인지/오븐 용기", "직화냄비", "찜기", "편수냄비"};
    private String[] sub091207 = {"소분류 사용안함", "김치통", "도시락/찬합", "도자기/유리용기", "물병", "물통", "법랑용기", "비닐접착기", "스텐용기", "시리얼디스펜서", "쌀통", "아이스트레이", "양념통/설탕프림기", "플라스틱용기", "항아리", "보온/보냉병", "기타보관용기"};
    private String[] sub091202 = {"소분류 사용안함", "공기", "대접", "공기대접세트", "단반상기", "디저트세트", "면기", "반상기", "볼", "소스기", "수저", "수저받침", "수저통", "양식기", "접시", "찬기", "티스푼", "티포크", "티스푼/티포크세트", "홈세트", "식판", "어린이식기"};
    private String[] sub091213 = {"소분류 사용안함", "디캔터", "스토퍼/세이버", "와인랙", "와인액세서리세트", "와인오프너", "와인쿨러"};
    private String[] sub091203 = {"소분류 사용안함", "다기/주기", "머그", "유리컵", "찻잔", "텀블러", "플라스틱컵", "와인잔", "샴페인잔", "스텐컵"};
    private String[] sub091214 = {"소분류 사용안함", "계량스푼", "계량컵", "계량저울", "쿠킹타이머", "모양깍지/짤주머니", "스패츌러/주걱", "빵칼", "와플팬", "유산지/베이킹컵", "제빵소도구", "식힘망", "돌림판", "작업판/매트", "밀대", "쿠키팬", "빵틀", "쿠키커터/모양틀", "핸드믹서기"};
    private String[] sub091216 = {"소분류 사용안함", "병풍", "유기제기", "제기", "제기세트", "제기함", "휴대용제기", "돗자리", "향/향로", "위패"};
    private String[] sub091211 = {"소분류 사용안함", "계란찜기/계란틀", "국자", "김밥/주먹밥틀", "달고나세트", "뒤집개", "믹싱볼", "바구니", "조리도구세트", "주걱", "집게", "채반", "퐁듀세트", "기타조리기구", "거품기", "오프너", "솔", "깔때기", "제면기", "스퀴저", "다시망/차거름망"};
    private String[] sub091210 = {"소분류 사용안함", "식기건조대", "싱크선반", "주방정리소품"};
    private String[] sub091215 = {"소분류 사용안함", "야채탈수기", "고무장갑", "냄비받침", "수세미", "컵받침/홀더", "쟁반", "랩", "롤백", "지퍼백", "비닐장갑", "쓰레기봉투", "일회용식기", "일회용도시락", "일회용젓가락", "커피스틱", "종이컵", "종이컵디스펜서", "쿠킹호일", "일회용빨대", "행주", "기타주방잡화"};
    private String[] sub091206 = {"소분류 사용안함", "주전자", "티세트", "티포트"};
    private String[] sub091208 = {"소분류 사용안함", "강판", "다지기", "절구", "주방가위", "채칼/필러", "칼", "칼갈이", "칼꽂이/블럭", "칼세트"};
    private String[] sub091212 = {"소분류 사용안함", "커피분쇄기", "커피추출기", "스팀피쳐/밀크저그", "드립포트", "우유거품기", "여과지", "템퍼"};
    private String[] sub091205 = {"소분류 사용안함", "구이팬", "궁중팬/튀김팬", "양면팬", "일반프라이팬", "프라이팬세트"};
    private String[] sub093201 = {"소분류 사용안함", "압축휴지통", "다용도휴지통", "음식물쓰레기통", "분리수거함"};
    private String[] sub090308 = {"소분류 사용안함", "수채화물감", "유화물감", "아크릴물감", "동양화물감", "포스터컬러"};
    private String[] sub090303 = {"소분류 사용안함", "아트백", "화구통/박스", "붓통/케이스"};
    private String[] sub090304 = {"소분류 사용안함", "이젤", "팔레트", "물통", "컬러가이드", "토시/앞치마/장갑", "목각인형", "아크릴판", "보조제/접착제/정착제"};
    private String[] sub090307 = {"소분류 사용안함", "구성붓/세필붓", "수채화붓", "유화붓", "아크릴붓", "서예/동양화붓"};
    private String[] sub090302 = {"소분류 사용안함", "먹", "먹물", "벼루", "연적", "문진", "전각재료", "멍석"};
    private String[] sub090309 = {"소분류 사용안함", "목탄/콘테", "수채색연필", "유성색연필", "파스텔", "오일파스텔", "마카", "크레파스"};
    private String[] sub090310 = {"소분류 사용안함", "라이트박스", "만화원고지", "펜촉/펜대", "스크린톤"};
    private String[] sub090305 = {"소분류 사용안함", "캔버스/판넬", "스케치북/크로키북", "미술용지", "한지/공예용지", "화선지", "골판지", "간지", "색종이/종이접기"};
    private String[] sub090311 = {"소분류 사용안함", "조소용품", "찰흙/점토", "클레이", "판화용품"};
    private String[] sub090306 = {"소분류 사용안함", "페인트", "염료", "잉크"};
    private String[] sub080302 = {"소분류 사용안함", "보스턴백", "캐디백", "하프백", "항공커버", "골프파우치", "골프백세트"};
    private String[] sub080305 = {"소분류 사용안함", "퍼팅용품", "스윙용품", "실외용품"};
    private String[] sub080303 = {"소분류 사용안함", "티셔츠", "니트", "점퍼", "재킷", "원피스", "조끼", "바지", "스커트"};
    private String[] sub080304 = {"소분류 사용안함", "장갑", "모자", "양말", "스타킹/레깅스", "벨트", "슈즈백", "스파이크"};
    private String[] sub080301 = {"소분류 사용안함", "드라이버", "페어웨이우드", "아이언", "하이브리드/유틸리티", "웨지", "치퍼", "퍼터", "연습용클럽", "주니어용클럽", "풀세트", "피팅헤드/샤프트"};
    private String[] sub080306 = {"소분류 사용안함", "거리측정기", "우산", "레인코트", "골프티", "그립", "헤드커버", "기타필드용품"};
    private String[] sub080310 = {"소분류 사용안함", "파크골프클럽", "파크골프공", "파크골프용품"};
    private String[] sub080609 = {"소분류 사용안함", "플라이어/니퍼", "가위/라인커터/핀온릴", "포셉/바늘빼기", "립그립/고기집게", "도래", "낚시칼", "기타낚시공구", "바늘결속기"};
    private String[] sub080602 = {"소분류 사용안함", "베이트릴", "스피닝릴", "전동릴", "플라이릴"};
    private String[] sub080607 = {"소분류 사용안함", "낚시의자", "낚시텐트", "밑밥주걱", "밑밥통/살림통", "두레박", "케미/집어등", "봉돌/싱커", "쿨백", "태클박스", "뜰채/망/꿰미", "가프", "기포기", "어군탐지기"};
    private String[] sub080608 = {"소분류 사용안함", "낚시복", "낚시조끼", "낚시신발", "낚시장갑", "낚시장화", "모자", "힙커버/힙가드"};
    private String[] sub080601 = {"소분류 사용안함", "민물낚싯대", "민물루어낚싯대", "바다민장대", "바다찌낚싯대", "플라이낚싯대", "바다루어낚싯대", "바다원투낚싯대", "바다선상낚싯대"};
    private String[] sub080603 = {"소분류 사용안함", "모노라인", "카본라인", "합사라인", "플라이라인"};
    private String[] sub080604 = {"소분류 사용안함", "하드베이트", "소프트베이트", "루어가방", "바늘", "루어로드케이스", "루어낚시세트"};
    private String[] sub080605 = {"소분류 사용안함", "떡밥", "민물낚시가방", "민물낚싯바늘", "민물낚시세트", "받침대/받침틀/뒤꽂이", "얼음낚시", "찌", "찌케이스"};
    private String[] sub080606 = {"소분류 사용안함", "밑밥", "바다낚시가방", "바다낚싯바늘", "바다낚시세트", "찌", "찌케이스"};
    private String[] sub080102 = {"소분류 사용안함", "재킷", "점퍼", "조끼", "반팔티셔츠", "긴팔티셔츠", "바지", "세트", "기능성언더웨어"};
    private String[] sub080105 = {"소분류 사용안함", "모자", "장갑", "양말"};
    private String[] sub080104 = {"소분류 사용안함", "아이젠", "스패츠", "나침반", "로프", "GPS", "스틱", "카라비너", "손난로", "핫팩"};
    private String[] sub080701 = {"소분류 사용안함", "남성사각", "남성삼각", "반신수영복", "전신수영복"};
    private String[] sub080703 = {"소분류 사용안함", "상의", "팬츠", "상하세트", "원피스", "스커트", "커플비치웨어"};
    private String[] sub080704 = {"소분류 사용안함", "수영모", "수경", "귀마개", "튜브", "구명조끼", "방수팩", "수영가방", "보트", "스노클/마스크", "오리발", "조립식수영장", "기타수영용품"};
    private String[] sub080702 = {"소분류 사용안함", "원피스수영복", "비키니", "모노키니", "반신수영복", "전신수영복"};
    private String[] sub080501 = {"소분류 사용안함", "재킷", "조끼", "티셔츠", "후드티", "하의", "상하세트"};
    private String[] sub080504 = {"소분류 사용안함", "데크", "바인딩", "부츠", "스노보드세트"};
    private String[] sub080503 = {"소분류 사용안함", "귀마개", "반다나", "비니", "양말", "장갑"};
    private String[] sub080506 = {"소분류 사용안함", "고글", "보드가방", "보수장비", "보호대", "스티커용품", "헬멧", "시즌권케이스"};
    private String[] sub080502 = {"소분류 사용안함", "상의", "하의", "상하세트"};
    private String[] sub080505 = {"소분류 사용안함", "부츠", "폴", "플레이트", "스키세트"};
    private String[] sub081206 = {"소분류 사용안함", "일반스쿠터", "전동스쿠터"};
    private String[] sub081203 = {"소분류 사용안함", "오일", "잠금장치", "튜닝용품", "기타오토바이부품"};
    private String[] sub081202 = {"소분류 사용안함", "헬멧", "보호대", "기타오토바이용품"};
    private String[] sub081204 = {"소분류 사용안함", "상의", "하의", "상하세트", "바이크장갑"};
    private String[] sub080901 = {"소분류 사용안함", "상의", "하의", "상하세트"};
    private String[] sub080401 = {"소분류 사용안함", "일반자전거", "MTB", "유사MTB", "미니벨로", "사이클", "전기자전거", "특수자전거", "하이브리드"};
    private String[] sub080403 = {"소분류 사용안함", "바엔드/그립", "변속기", "브레이크", "스탠드", "시트포스트", "안장", "체인", "클릿/페달", "타이어/튜브", "프레임/포크", "핸들바", "휠셋/림/스프라켓", "기타자전거부품"};
    private String[] sub080404 = {"소분류 사용안함", "거치대", "공구", "물통", "케이지", "백미러", "벨", "보조바퀴", "보호대", "속도계", "자전거가방", "오일", "세척제", "자물쇠", "자전거라이트", "짐받이", "펌프", "헬멧", "흙받이", "기타자전거용품", "바테이프"};
    private String[] sub080402 = {"소분류 사용안함", "상의", "하의", "상하세트", "신발", "장갑", "두건/밴드", "배낭"};
    private String[] sub081304 = {"소분류 사용안함", "슈즈백", "필드용"};
    private String[] sub080207 = {"소분류 사용안함", "손전등", "실내등", "헤드랜턴", "랜턴걸이/스탠드"};
    private String[] sub080208 = {"소분류 사용안함", "코펠", "버너", "더치오븐", "바비큐그릴/화로대", "휴대용가스레인지", "캠핑컵", "캠핑주전자", "다용도칼", "수저/커트러리", "설거지용품", "연료", "부탄가스", "기타취사용품"};
    private String[] sub080209 = {"소분류 사용안함", "캠핑테이블", "캠핑의자", "테이블세트", "캠핑박스", "파라솔", "야전침대", "해먹"};
    private String[] sub080203 = {"소분류 사용안함", "방수포/그라운드시트", "폴대", "스트링/로프", "기타텐트/타프용품"};
    private String[] sub080801 = {"소분류 사용안함", "접이식", "고정식"};
    private String[] sub080802 = {"소분류 사용안함", "벤치프레스", "싯업벤치", "웨이트용품", "바벨", "봉/바", "복합헬스머신", "스쿼트머신"};
    private String[] sub080803 = {"소분류 사용안함", "폼롤러", "짐볼/돔볼", "푸시업바", "헬스장갑", "모래주머니", "손목근력기", "악력기", "완력기", "기타헬스소품"};
    private String[] sub070901 = {"소분류 사용안함", "봉지라면", "컵라면"};
    private String[] sub070902 = {"소분류 사용안함", "국수면", "당면", "스파게티면", "냉면", "칼국수면", "소바", "우동", "쫄면", "쌀국수면", "소면"};
    private String[] sub070907 = {"소분류 사용안함", "마요네즈", "케첩", "스파게티소스", "기타소스"};
    private String[] sub070908 = {"소분류 사용안함", "맛살/게살", "해물볶음류", "해물찜류", "해물탕류", "해물튀김류"};
    private String[] sub070905 = {"소분류 사용안함", "식용유", "올리브유", "카놀라유", "포도씨유", "해바라기씨유", "들기름", "참기름", "기타기름"};
    private String[] sub070906 = {"소분류 사용안함", "고추장", "된장", "간장", "청국장", "쌈장", "양념장", "메주", "기타장류"};
    private String[] sub070904 = {"소분류 사용안함", "고춧가루", "식초", "액젓", "고추냉이", "후추", "기타조미료", "겨자"};
    private String[] sub070903 = {"소분류 사용안함", "슬라이스치즈", "피자치즈", "크림치즈", "기타치즈"};
    private String[] sub070938 = {"소분류 사용안함", "밥/죽", "찌개/국", "면/파스타", "구이", "볶음/튀김", "조림/찜", "간식/디저트", "세트요리"};
    private String[] sub071110 = {"소분류 사용안함", "양배추즙", "양파즙", "호박즙", "비트즙", "칡즙", "토마토즙", "기타건강즙"};
    private String[] sub071111 = {"소분류 사용안함", "석류즙", "사과즙", "포도즙", "아로니아즙", "배즙", "블루베리즙", "기타과일즙"};
    private String[] sub071104 = {"소분류 사용안함", "멀티비타민", "비타민A", "비타민B", "비타민C", "기타비타민", "비타민D", "비타민E", "비오틴"};
    private String[] sub071109 = {"소분류 사용안함", "로얄제리", "엽산", "아연", "철분", "칼슘", "마그네슘", "프로폴리스", "글루코사민", "오메가3", "감마리놀렌산", "루테인", "스쿠알렌", "쏘팔메토", "키토산", "환자식/영양보충식", "효모", "기타건강보조식품", "알로에정/겔", "코큐텐", "스피루리나", "클로렐라", "프로바이오틱스", "프리바이오틱스", "밀크씨슬", "폴리코사놀", "보스웰리아", "셀레늄", "칼륨", "MSM", "크릴오일"};
    private String[] sub071107 = {"소분류 사용안함", "가시오가피", "감초", "계피", "구기자", "녹용", "산수유", "오미자", "헛개나무", "황기", "기타한방재료"};
    private String[] sub070306 = {"소분류 사용안함", "감말랭이", "건망고", "건바나나", "건자두", "건포도", "곶감", "기타건과류"};
    private String[] sub070305 = {"소분류 사용안함", "호두", "땅콩", "밤", "대추", "은행", "아몬드", "잣", "캐슈너트", "해바라기씨", "마카다미아", "피스타치오", "피칸", "호박씨", "기타견과류"};
    private String[] sub070303 = {"소분류 사용안함", "사과", "배", "토마토", "감귤", "딸기", "블루베리", "석류", "감", "매실", "멜론", "복분자", "수박", "키위/참다래", "참외", "천혜향", "한라봉", "포도", "자두", "복숭아", "리치", "체리", "레몬", "망고", "바나나", "오렌지", "자몽", "파인애플", "아보카도", "기타과일", "과일바구니", "혼합과일세트"};
    private String[] sub070301 = {"소분류 사용안함", "백미", "찹쌀", "현미", "흑미", "기능성쌀"};
    private String[] sub070302 = {"소분류 사용안함", "보리", "율무", "녹두", "들깨", "참깨", "메밀", "옥수수", "수수", "기장", "콩", "팥", "혼합곡", "기타잡곡"};
    private String[] sub070304 = {"소분류 사용안함", "배추", "마늘", "오이", "도라지", "무", "고구마", "애호박", "단호박", "가지", "양파", "대파", "쪽파", "더덕", "우엉", "고추", "버섯", "생강", "양배추", "상추", "쌈채소", "시금치", "감자", "당근", "연근", "열무", "마", "부추", "피망/파프리카", "새싹채소", "아스파라거스", "죽순", "알로에", "기타채소류", "브로콜리", "건나물", "산나물", "삶은나물"};
    private String[] sub071209 = {"소분류 사용안함", "곤약쌀", "곤약젤리", "기타곤약가공품"};
    private String[] sub070205 = {"소분류 사용안함", "멸치", "쥐포", "오징어", "한치", "문어", "건새우", "과메기", "노가리", "진미채", "황태", "기타건어물"};
    private String[] sub070202 = {"소분류 사용안함", "김", "다시마", "매생이", "미역", "해초샐러드", "기타해초"};
    private String[] sub070201 = {"소분류 사용안함", "갈치", "고등어", "굴비", "장어", "옥돔", "조기", "참치", "동태", "초밥재료", "홍어", "생선회", "연어/훈제연어", "기타생선"};
    private String[] sub070204 = {"소분류 사용안함", "대하장", "명란젓", "새우젓", "오징어젓", "낙지젓", "조개젓", "창난젓", "토하젓", "게장", "젓갈선물세트", "기타젓갈"};
    private String[] sub070203 = {"소분류 사용안함", "전복", "꽃게", "킹크랩", "해삼", "꼬막", "홍합", "새우", "소라", "골뱅이", "문어", "오징어", "낙지", "주꾸미", "조개", "바닷가재", "굴", "멍게", "날치알", "기타해산물", "대게/홍게", "가리비"};
    private String[] sub070604 = {"소분류 사용안함", "감귤주스", "오렌지주스", "사과주스", "망고주스", "자몽주스", "토마토주스", "포도주스", "기타과즙음료"};
    private String[] sub070606 = {"소분류 사용안함", "코코아", "녹차", "홍차", "허브차", "보이차", "기타차", "옥수수수염차", "유자차", "율무차", "우엉차"};
    private String[] sub070603 = {"소분류 사용안함", "과즙탄산음료", "에이드음료", "무알콜음료", "사이다", "콜라", "아이스티", "이온음료", "기타탄산음료"};
    private String[] sub070605 = {"소분류 사용안함", "원두/생두", "커피음료", "커피믹스/인스턴트커피", "프림", "더치커피", "캡슐커피"};
    private String[] sub071307 = {"소분류 사용안함", "와인", "복분자주", "과일주"};
    private String[] sub070103 = {"소분류 사용안함", "부위별닭고기", "생닭"};
    private String[] sub070101 = {"소분류 사용안함", "국내산돼지고기", "수입산돼지고기"};
    private String[] sub070102 = {"소분류 사용안함", "국내산육우", "한우", "수입산쇠고기"};
    private String[] sub070106 = {"소분류 사용안함", "훈제란", "달걀", "메추리알", "오리알"};
    private String[] sub070107 = {"소분류 사용안함", "오리훈제", "갈비찜", "돈가스", "돈육훈제", "돼지양념육", "쇠고기양념육", "닭양념육", "오리양념육", "떡갈비", "베이컨", "족발", "햄", "소시지", "순대", "육포", "삼계탕", "닭가공품", "오리가공품", "기타육가공"};
    private String[] sub100204 = {"소분류 사용안함", "뮤지컬", "콘서트", "연극", "전시/행사", "클래식", "오페라", "발레/무용", "국악/전통예술", "스포츠"};
    private String[] sub100205 = {"소분류 사용안함", "스키/보드 리프트권", "스키/보드 시즌권", "눈썰매장", "워터파크", "아쿠아리움", "테마/놀이동산", "래프팅", "스파/찜질방", "수상레저", "기타레저이용권", "체험"};
    private String[] sub100501 = {"소분류 사용안함", "백화점/마트", "패스트푸드", "카페/베이커리", "피자", "아이스크림", "쇼핑몰상품권", "데이터/통화/문자", "도서/문화상품권", "게임/E머니", "기타 푸드/음료", "영화/공연관람권", "헤어/뷰티/건강", "주유", "뷔페/레스토랑", "치킨/배달음식", "편의점상품", "기타 e쿠폰"};
    private String[] sub100505 = {"소분류 사용안함", "꽃배달", "케이크배달"};
    private String[] sub100504 = {"소분류 사용안함", "오디오북", "VOD", "e북", "만화", "기타 콘텐츠"};
    private String[] sub100503 = {"소분류 사용안함", "주유상품권", "백화점/마트상품권", "도서/문화상품권", "영화상품권", "외식상품권", "기타상품권", "기프트카드"};
    private String[] sub100604 = {"소분류 사용안함", "스키/보드", "서핑/다이빙", "기타"};
    private String[] sub100101 = {"소분류 사용안함", "가죽공예", "플라워", "드로잉", "도자기", "목공예", "캔들/방향제/향수", "비누", "주얼리", "뜨개질", "자수", "수예", "기타수공예"};
    private String[] sub100102 = {"소분류 사용안함", "베이킹", "기타쿠킹"};
    private String[] sub100701 = {"소분류 사용안함", "영어", "기타외국어"};
    private String[] sub063201 = {"소분류 사용안함", "한글교구", "수학교구", "영어교구", "자연/과학교구", "미술교구", "기타교구"};
    private String[] sub060203 = {"소분류 사용안함", "천기저귀", "수영장기저귀", "땅콩기저귀", "기저귀커버", "기저귀밴드"};
    private String[] sub060305 = {"소분류 사용안함", "비데용", "손소독용"};
    private String[] sub063003 = {"소분류 사용안함", "도형끼우기", "링쌓기/컵쌓기", "멜로디완구", "비눗방울", "아기전화기", "헝겊완구/헝겊책", "기타감각발달완구"};
    private String[] sub063004 = {"소분류 사용안함", "그네/그네봉", "놀이집", "다기능놀이터", "미끄럼틀", "볼텐트/놀이텐트"};
    private String[] sub063005 = {"소분류 사용안함", "구명조끼", "목튜브/암링", "스노클링", "보트", "보행기튜브", "풀장", "튜브", "물총", "비치볼"};
    private String[] sub063006 = {"소분류 사용안함", "클레이", "플레이콘/매직콘", "그림판", "물감", "색연필", "색칠공부", "스케치북", "이젤", "크레욜라", "크레파스", "종이접기", "오리기", "기타미술놀이"};
    private String[] sub063007 = {"소분류 사용안함", "레고", "빅블록", "사각/십자블록", "옥스포드", "원목블록", "자석블록", "종이/소프트블록", "기타블록"};
    private String[] sub063008 = {"소분류 사용안함", "골프", "공/소프트볼", "볼링", "스카이콩콩", "스키/눈썰매", "야구/캐치볼", "축구대", "농구대", "트램펄린/덤블링", "펀치백/권투", "헬스기구", "호핑볼/점핑볼", "기타스포츠완구"};
    private String[] sub063009 = {"소분류 사용안함", "붕붕카", "스프링카", "시소", "왜건", "전동차", "지붕차", "킥보드/씽씽이", "트레일러", "흔들말", "기타승용완구"};
    private String[] sub063011 = {"소분류 사용안함", "딸랑이", "모빌", "아기체육관", "아기걸음마", "오뚝이", "치아발육기", "베이비룸", "플레이매트", "신생아완구세트", "기타신생아/영유아완구"};
    private String[] sub063012 = {"소분류 사용안함", "학습보드판", "낱말카드/학습카드", "디지털학습완구", "유아용컴퓨터", "자석놀이", "학습벽보", "기타언어/학습완구"};
    private String[] sub063013 = {"소분류 사용안함", "공구놀이", "낚시놀이", "모래놀이", "병원놀이", "소꿉놀이", "가게놀이", "가사놀이", "인형유모차", "주방놀이", "쿠킹토이", "화장놀이", "기타역할놀이/소꿉놀이"};
    private String[] sub063014 = {"소분류 사용안함", "가베", "도미노", "도형쌓기", "롤러코스터", "셈놀이/숫자놀이판", "실꿰기/구슬꿰기", "원목큐브", "하노이탑"};
    private String[] sub063010 = {"소분류 사용안함", "다기능자전거", "보조바퀴체인자전거", "세발자전거", "밸런스자전거"};
    private String[] sub063016 = {"소분류 사용안함", "구슬퍼즐", "도형퍼즐/칠교놀이", "원목/꼭지퍼즐", "종이/입체퍼즐", "직소퍼즐/액자", "큐브/소마큐브", "숫자퍼즐", "그림퍼즐", "기타유아동퍼즐"};
    private String[] sub063017 = {"소분류 사용안함", "나팔", "드럼", "마이크/노래방", "멜로디언/키보드", "실로폰", "악기세트", "피아노", "기타음악/악기놀이", "타악기"};
    private String[] sub063015 = {"소분류 사용안함", "공룡", "동물학습", "과학상자", "기초로봇", "망원경", "물로켓/고무동력기", "식물학습", "곤충학습", "현미경"};
    private String[] sub063002 = {"소분류 사용안함", "로봇", "메카드시리즈", "자동차", "기차", "동물작동완구", "로봇강아지", "비행기", "오토바이", "장난감총", "헬기", "팽이", "기타작동완구"};
    private String[] sub060705 = {"소분류 사용안함", "유모차시트", "유모차커버", "유모차보호대/안전바", "유모차정리망/정리함", "유모차걸이", "유모차풋머프", "유모차장난감", "유모차홀더", "유모차목쿠션/블랭킷", "유모차햇빛가리개", "기타유모차용품"};
    private String[] sub062602 = {"소분류 사용안함", "백팩", "신발주머니/보조가방", "토트백/숄더백", "크로스백", "캐리어백", "미아방지가방"};
    private String[] sub062601 = {"소분류 사용안함", "보행기신발", "구두", "부츠/털신", "샌들", "운동화", "실내화", "아쿠아슈즈", "슬리퍼", "장화", "젤리슈즈"};
    private String[] sub062616 = {"소분류 사용안함", "헤어밴드", "헤어핀", "헤어끈"};
    private String[] sub061910 = {"소분류 사용안함", "수유브라", "임부팬티", "임부내복", "임부러닝", "임산부복대"};
    private String[] sub062007 = {"소분류 사용안함", "태교용구", "태교음반/DVD"};
    private String[] sub062202 = {"소분류 사용안함", "상대여", "돌잔치소품", "행사용스티커", "답례품"};
    private String[] sub062201 = {"소분류 사용안함", "촬영의상", "촬영소품"};
    private String[] sub060804 = {"소분류 사용안함", "햇빛가리개", "차량안전벨트", "카시트기타용품"};
    private String[] sub010406 = {"소분류 사용안함", "보정상의", "보정하의", "복대"};
    private String[] sub010405 = {"소분류 사용안함", "내복", "모시메리"};
    private String[] sub010206 = {"소분류 사용안함", "니퍼/복대", "코르셋", "올인원/바디쉐이퍼", "거들", "보정속옷세트", "기타보정속옷"};
    private String[] sub010205 = {"소분류 사용안함", "내복", "힙워머", "모시메리"};
    private String[] sub010210 = {"소분류 사용안함", "가터벨트", "브라끈", "브라패드", "땀패드", "기타언더웨어소품"};
    private String[] sub020213 = {"소분류 사용안함", "작업화/안전화", "컴포트화", "한복신발", "댄스화"};
    private String[] sub020201 = {"소분류 사용안함", "러닝화", "보드화", "하이탑", "아쿠아슈즈", "워킹화", "캔버스화"};
    private String[] sub020901 = {"소분류 사용안함", "일반캡", "메시캡"};
    private String[] sub020903 = {"소분류 사용안함", "일반캡", "메시캡"};
    private String[] sub020802 = {"소분류 사용안함", "정장벨트", "캐주얼벨트"};
    private String[] sub021505 = {"소분류 사용안함", "시계줄", "시계보관함", "보호필름"};
    private String[] sub021504 = {"소분류 사용안함", "가죽밴드시계", "메탈밴드시계", "금시계", "뱅글/팔찌형시계", "젤리/우레탄밴드시계", "회중시계", "스톱워치", "기타밴드시계"};
    private String[] sub021102 = {"소분류 사용안함", "발목양말", "중목/장목양말", "스포츠양말", "발가락양말", "수면양말"};
    private String[] sub021101 = {"소분류 사용안함", "덧신", "발목양말", "중목/장목양말", "니삭스", "스포츠양말", "발가락양말", "수면양말", "레그워머"};
    private String[] sub020407 = {"소분류 사용안함", "가방걸이", "가방끈"};
    private String[] sub020110 = {"소분류 사용안함", "유니폼화", "작업화/안전화", "컴포트화", "한복신발", "다이어트화", "댄스화"};
    private String[] sub020104 = {"소분류 사용안함", "플랫", "로퍼", "옥스퍼드화", "모카신/털신", "슬립온", "스니커즈"};
    private String[] sub020101 = {"소분류 사용안함", "롱부츠", "미들부츠", "앵클/숏부츠"};
    private String[] sub020109 = {"소분류 사용안함", "슬링백샌들", "스트랩샌들", "웨지힐샌들", "글래디에이터샌들", "젤리샌들", "아쿠아샌들", "뮬/블로퍼"};
    private String[] sub020106 = {"소분류 사용안함", "러닝화", "보드화", "하이탑", "아쿠아슈즈", "워킹화", "캔버스화"};
    private String[] sub020103 = {"소분류 사용안함", "플랫워커", "워커힐"};
    private String[] sub020105 = {"소분류 사용안함", "하이힐", "가보시힐", "스트랩힐", "슬링백힐", "웨지힐", "토오픈힐", "통굽힐", "펌프스", "웨딩슈즈"};
    private String[] sub021702 = {"소분류 사용안함", "다이아몬드 귀걸이", "14K귀걸이", "18K귀걸이", "순금귀걸이", "은귀걸이", "유색보석귀걸이", "진주귀걸이", "패션귀걸이", "이니셜귀걸이", "피어싱", "귀걸이만들기"};
    private String[] sub021703 = {"소분류 사용안함", "다이아몬드목걸이", "14K목걸이", "18K목걸이", "순금목걸이", "은목걸이", "유색보석목걸이", "진주목걸이", "패션목걸이", "이니셜목걸이", "목걸이만들기"};
    private String[] sub021701 = {"소분류 사용안함", "다이아몬드반지", "14K반지", "18K반지", "순금반지", "은반지", "유색보석반지", "진주반지", "패션반지", "이니셜반지", "반지만들기"};
    private String[] sub021708 = {"소분류 사용안함", "패션발찌", "순금발찌"};
    private String[] sub021706 = {"소분류 사용안함", "다이아몬드세트", "14K세트", "18K세트", "은세트", "유색보석세트", "진주세트", "패션주얼리세트", "순금주얼리세트"};
    private String[] sub021707 = {"소분류 사용안함", "보관함/케이스", "진열대", "세척용품", "기타주얼리소품"};
    private String[] sub021704 = {"소분류 사용안함", "금팔찌", "은팔찌", "패션팔찌", "순금팔찌", "팔찌만들기"};
    private String[] sub021705 = {"소분류 사용안함", "금펜던트", "은펜던트", "유색보석펜던트", "패션펜던트", "순금펜던트"};
    private String[] sub020702 = {"소분류 사용안함", "반지갑", "중지갑", "장지갑"};
    private String[] sub020701 = {"소분류 사용안함", "반지갑", "중지갑", "장지갑"};
    private String[] sub021403 = {"소분류 사용안함", "기본넥타이", "나비넥타이", "넥타이핀"};
    private String[] sub021419 = {"소분류 사용안함", "라이터", "담배케이스", "기타담배용품"};
    private String[] sub021413 = {"소분류 사용안함", "보석브로치", "패션브로치", "카네이션브로치"};
    private String[] sub021402 = {"소분류 사용안함", "남성용", "여성용"};
    private String[] sub021401 = {"소분류 사용안함", "롱", "쁘띠/미니"};
    private String[] sub021412 = {"소분류 사용안함", "발목스타킹", "판타롱스타킹", "밴드스타킹", "팬티스타킹", "압박보정스타킹", "스프레이스타킹"};
    private String[] sub021411 = {"소분류 사용안함", "수동양산", "자동양산"};
    private String[] sub021410 = {"소분류 사용안함", "수동우산", "자동우산"};
    private String[] sub021301 = {"소분류 사용안함", "남성가발", "여성가발"};
    private String[] sub030206 = {"소분류 사용안함", "루스파우더", "팩트파우더"};
    private String[] sub030205 = {"소분류 사용안함", "리퀴드형", "스틱형", "크림형", "쿠션형"};
    private String[] sub031305 = {"소분류 사용안함", "립브러시", "아이브러시", "페이스브러시", "브러시세트"};
    private String[] sub031301 = {"소분류 사용안함", "뷰러", "속눈썹/속눈썹펌제", "쌍꺼풀", "눈썹칼", "눈썹가위", "족집게", "샤프너", "기타아이소품"};
    private String[] sub031302 = {"소분류 사용안함", "기름종이", "화장솜", "퍼프", "마사지도구", "세안도구", "코털제거기", "피지/각질제거기", "기타페이스소품", "면봉"};
    private String[] sub031303 = {"소분류 사용안함", "헤어브러시", "미용가위", "헤어롤", "세안밴드", "헤어캡", "기타헤어소품"};
    private String[] sub030307 = {"소분류 사용안함", "리퀴드형", "젤형", "펜슬형"};
    private String[] sub030607 = {"소분류 사용안함", "태닝스프레이", "태닝오일", "태닝크림", "태닝티슈"};
    private String[] sub031107 = {"소분류 사용안함", "스트레이트", "웨이브"};
    private String[] sub042407 = {"소분류 사용안함", "1394케이블", "D-SUB케이블", "DVI케이블", "HDMI케이블", "SATA케이블", "USB케이블", "광케이블", "랜케이블", "비디오케이블", "오디오케이블", "젠더", "전원케이블", "기타케이블"};
    private String[] sub042307 = {"소분류 사용안함", "CD/DVD콤보", "CD-ROM", "CD레코더", "DVD-ROM", "DVD레코더", "블루레이"};
    private String[] sub080201 = {"소분류 사용안함", "1-2인용", "2-3인용", "3-4인용", "4-5인용", "5-6인용", "6-7인용", "7-8인용", "9인용 이상"};


    public String[] getSecondtag(String pretag){
        switch(pretag)
        {
            case "가구/인테리어":
                return sub050000;
            case "도서":
                return sub120000;
            case "디지털/가전":
                return sub040000;
            case "면세점":
                return sub110000;
            case "생활/건강":
                return sub090000;
            case "스포츠/레저":
                return sub080000;
            case "식품":
                return sub070000;
            case "여가/생활편의":
                return sub100000;
            case "출산/육아":
                return sub060000;
            case "패션의류":
                return sub010000;
            case "패션잡화":
                return sub020000;
            case "화장품/미용":
                return sub030000;

            default:
                return sub00;
        }
    }

    public String[] getThreetag(String pretag, String maintag)
    {
        switch(pretag)
        {

            case "DIY자재/용품":
                return sub050800;
            case "거실가구":
                return sub050200;
            case "서재/사무용가구":
                return sub050600;
            case "솜류":
                return sub051200;
            case "수납가구":
                return sub050400;
            case "수예":
                return sub051600;
            case "아동/주니어가구":
                return sub050500;
            case "아웃도어가구":
                return sub050700;
            case "인테리어소품":
                return sub050900;
            case "주방가구":
                return sub050300;
            case "침구단품":
                return sub051000;
            case "침구세트":
                return sub051100;
            case "침실가구":
                return sub050100;
            case "카페트/러그":
                return sub051300;
            case "커튼/블라인드":
                return sub051400;
            case "홈데코":
                return sub051500;
            case "가정/요리":
                return sub121300;
            case "건강/취미":
                return sub122200;
            case "경제/경영":
                return sub120300;
            case "고등학교 참고서":
                return sub122300;
            case "국어/외국어":
                return sub121500;
            case "만화":
                return sub121900;
            case "사회/정치":
                return sub120700;
            case "소설/시":
                return sub120100;
            case "수험서/자격증":
                return sub121800;
            case "어린이":
                return sub121200;
            case "에세이":
                return sub120200;
            case "여행":
                return sub121400;
            case "역사":
                return sub120600;
            case "예술/대중문화":
                return sub120900;
            case "외국도서":
                return sub122100;
            case "유아":
                return sub121100;
            case "인문":
                return sub120500;
            case "자기계발":
                return sub120400;
            case "자연/과학":
                return sub120800;
            case "잡지":
                return sub122000;
            case "종교":
                if(maintag.equals("도서"))
                    return sub121000;
                else if(maintag.equals("생활/건강"))
                    return sub091100;
                else
                    return sub00;
            case "중고도서":
                return sub122600;
            case "중학교 참고서":
                return sub122400;
            case "청소년":
                return sub121700;
            case "초등학교 참고서":
                return sub122500;
            case "컴퓨터/IT":
                return sub121600;
            case "PC":
                return sub041500;
            case "PC부품":
                return sub042400;
            case "PC액세서리":
                return sub041600;
            case "게임기/타이틀":
                return sub041400;
            case "계절가전":
                return sub041100;
            case "광학기기/용품":
                return sub042700;
            case "네트워크장비":
                return sub042500;
            case "노트북액세서리":
                return sub040200;
            case "멀티미디어장비":
                return sub042200;
            case "모니터주변기기":
                return sub042000;
            case "생활가전":
                return sub040700;
            case "소프트웨어":
                return sub042600;
            case "영상가전":
                return sub040500;
            case "음향가전":
                return sub040600;
            case "이미용가전":
                return sub040800;
            case "자동차기기":
                return sub041000;
            case "저장장치":
                return sub042300;
            case "주방가전":
                return sub040900;
            case "주변기기":
                return sub042100;
            case "카메라/캠코더용품":
                return sub040400;
            case "태블릿PC액세서리":
                return sub041800;
            case "학습기기":
                return sub041300;
            case "휴대폰":
                return sub041200;
            case "휴대폰액세서리":
                return sub040300;
            case "시계/기프트":
                return sub110300;
            case "식품/건강":
                return sub110700;
            case "전자제품":
                return sub110600;
            case "주얼리":
                if(maintag.equals("면세점"))
                    return sub110400;
                else if(maintag.equals("패션잡화"))
                    return sub021700;
                else
                    return sub00;
            case "패션/잡화":
                return sub110500;
            case "향수":
                if(maintag.equals("면세점"))
                    return sub110200;
                else if(maintag.equals("화장품/미용"))
                    return sub030800;
                else
                    return sub00;
            case "화장품":
                return sub110100;
            case "DVD":
                return sub091000;
            case "건강관리용품":
                return sub091500;
            case "건강측정용품":
                return sub091400;
            case "공구":
                return sub090100;
            case "관상어용품":
                return sub090600;
            case "구강위생용품":
                return sub092300;
            case "냉온/찜질용품":
                return sub092200;
            case "눈건강용품":
                return sub092400;
            case "당뇨관리용품":
                return sub091600;
            case "문구/사무용품":
                return sub090200;
            case "물리치료/저주파용품":
                return sub092000;
            case "반려동물":
                return sub090800;
            case "발건강용품":
                return sub092500;
            case "블루레이":
                return sub092900;
            case "생활용품":
                return sub093300;
            case "세탁용품":
                return sub091300;
            case "수납/정리용품":
                return sub093100;
            case "수집품":
                return sub090500;
            case "실버용품":
                return sub091800;
            case "악기":
                return sub090700;
            case "안마용품":
                return sub092800;
            case "욕실용품":
                return sub093000;
            case "원예/식물":
                return sub092600;
            case "음반":
                return sub090900;
            case "의료용품":
                return sub091700;
            case "자동차용품":
                return sub090400;
            case "재활운동용품":
                return sub091900;
            case "정원/원예용품":
                return sub092700;

            case "좌욕/좌훈용품":
                return sub092100;
            case "주방용품":
                return sub091200;
            case "청소용품":
                return sub093200;
            case "화방용품":
                return sub090300;
            case "검도":
                return sub082400;
            case "골프":
                return sub080300;
            case "권투":
                return sub082600;
            case "낚시":
                return sub080600;
            case "농구":
                return sub081500;
            case "댄스":
                return sub082500;
            case "등산":
                return sub080100;
            case "무술용품":
                return sub082800;
            case "배구":
                return sub081600;
            case "배드민턴":
                return sub081800;
            case "보호용품":
                return sub082700;
            case "볼링":
                return sub082200;
            case "수련용품":
                return sub082900;
            case "수영":
                return sub080700;
            case "스케이트/보드/롤러":
                return sub081100;
            case "스쿼시":
                return sub082000;
            case "스키/보드":
                return sub080500;
            case "스킨스쿠버":
                return sub082300;
            case "스포츠액세서리":
                return sub083000;
            case "야구":
                return sub081400;
            case "오토바이/스쿠터":
                return sub081200;
            case "요가/필라테스":
                return sub080900;
            case "인라인스케이트":
                return sub081000;
            case "자전거":
                return sub080400;
            case "족구":
                return sub082100;
            case "축구":
                return sub081300;
            case "캠핑":
                return sub080200;
            case "탁구":
                return sub081700;
            case "테니스":
                return sub081900;
            case "헬스":
                return sub080800;
            case "가공식품":
                return sub070900;
            case "건강식품":
                return sub071100;
            case "과자":
                return sub070700;
            case "김치":
                return sub070500;
            case "냉동/간편조리식품":
                return sub071000;
            case "농산물":
                return sub070300;
            case "다이어트식품":
                return sub071200;
            case "반찬":
                return sub070400;
            case "수산":
                return sub070200;
            case "아이스크림/빙수":
                return sub070800;
            case "음료":
                return sub070600;
            case "전통주":
                return sub071300;
            case "축산":
                return sub070100;
            case "국내여행/체험":
                return sub100200;
            case "렌터카":
                return sub100400;
            case "생활편의":
                return sub100500;
            case "예체능레슨":
                return sub100600;
            case "원데이클래스":
                return sub100100;
            case "자기계발/취미 레슨":
                return sub100700;
            case "해외여행":
                return sub100300;
            case "홈케어서비스":
                return sub100800;
            case "교구":
                return sub063200;
            case "구강청결용품":
                return sub061300;
            case "기저귀":
                return sub060200;
            case "목욕용품":
                return sub061000;
            case "물티슈":
                return sub060300;
            case "분유":
                return sub060100;
            case "소독/살균용품":
                return sub061500;
            case "수영복/용품":
                return sub062700;
            case "수유용품":
                return sub060600;
            case "스킨/바디용품":
                return sub061100;
            case "신생아의류":
                return sub062300;
            case "아기간식":
                return sub060500;
            case "안전용품":
                return sub061600;
            case "완구/매트":
                return sub063000;
            case "외출용품":
                return sub060900;
            case "위생/건강용품":
                return sub061200;
            case "유모차":
                return sub060700;
            case "유아가구":
                return sub061700;
            case "유아동 주얼리":
                return sub062800;
            case "유아동언더웨어/잠옷":
                return sub062500;
            case "유아동의류":
                return sub062400;
            case "유아동잡화":
                return sub062600;
            case "유아발육용품":
                return sub062900;
            case "유아세제":
                return sub061400;
            case "유아침구":
                return sub062100;
            case "이유식":
                return sub060400;
            case "이유식용품":
                return sub061800;
            case "인형":
                return sub063100;
            case "임부복":
                return sub061900;
            case "임산부용품":
                return sub062000;
            case "출산/돌기념품":
                return sub062200;
            case "카시트":
                return sub060800;
            case "남성언더웨어/잠옷":
                return sub010400;
            case "남성의류":
                return sub010300;
            case "여성언더웨어/잠옷":
                return sub010200;
            case "여성의류":
                return sub010100;
            case "남성가방":
                return sub020500;
            case "남성신발":
                return sub020200;
            case "모자":
                return sub020900;
            case "벨트":
                return sub020800;
            case "선글라스/안경테":
                return sub021200;
            case "순금":
                return sub021600;
            case "시계":
                return sub021500;
            case "신발용품":
                return sub020300;
            case "양말":
                return sub021100;
            case "여성가방":
                return sub020400;
            case "여성신발":
                return sub020100;
            case "여행용가방/소품":
                return sub020600;
            case "장갑":
                return sub021000;
            case "지갑":
                return sub020700;
            case "패션소품":
                return sub021400;
            case "헤어액세서리":
                return sub021300;
            case "남성화장품":
                return sub030700;
            case "네일케어":
                return sub031200;
            case "마스크/팩":
                return sub030500;
            case "바디케어":
                return sub030900;
            case "베이스메이크업":
                return sub030200;
            case "뷰티소품":
                return sub031300;
            case "색조메이크업":
                return sub030300;
            case "선케어":
                return sub030600;
            case "스킨케어":
                return sub030100;
            case "클렌징":
                return sub030400;
            case "헤어스타일링":
                return sub031100;
            case "헤어케어":
                return sub031000;
            case "소분류 사용안함":
                return sub00;
            default:
                return sub01;
        }
    }

    public String[] getFourtag(String pretag, String sectag)
    {
        switch(pretag)
        {

            case "가구부속품":
                return sub050803;
            case "리모델링":
                return sub050814;
            case "바닥재":
                return sub050804;
            case "벽지":
                return sub050810;
            case "시트지":
                return sub050811;
            case "타일":
                return sub050806;
            case "소파":
                return sub050201;
            case "테이블":
                return sub050202;
            case "사무/교구용가구":
                return sub050605;
            case "의자":
                return sub050602;
            case "책상":
                return sub050601;
            case "베개솜/속통":
                return sub051202;
            case "요솜/매트솜":
                return sub051203;
            case "이불솜":
                return sub051201;
            case "뜨개질":
                return sub051601;
            case "자수":
                return sub051602;
            case "퀼트/펠트":
                return sub051603;
            case "침대":
                if(sectag.equals("아동/주니어가구"))
                    return sub050506;
                else if(sectag.equals("침실가구"))
                    return sub050101;
                else
                    return sub00;
            case "미술작품":
                return sub050922;
            case "스탠드":
                if(sectag.equals("인테리어소품"))
                    return sub050901;
                else if(sectag.equals("생활가전"))
                    return sub040707;
                else
                    return sub00;
            case "아로마/캔들용품":
                return sub050905;
            case "액자":
                return sub050904;
            case "조명":
                return sub050902;
            case "식탁/의자":
                return sub050301;
            case "매트/침대커버":
                return sub051001;
            case "베개":
                return sub051002;
            case "요":
                return sub051007;
            case "패드":
                return sub051006;
            case "매트커버세트":
                return sub051103;
            case "요이불세트":
                return sub051101;
            case "이불베개세트":
                return sub051104;
            case "이불패드세트":
                return sub051105;
            case "침대커버세트":
                return sub051102;
            case "거울":
                return sub050105;
            case "매트리스":
                return sub050102;
            case "장롱/붙박이장":
                return sub050103;
            case "화장대":
                return sub050104;
            case "카페트":
                return sub051301;
            case "커튼":
                return sub051401;
            case "주방데코":
                return sub051502;
            case "커버류":
                return sub051501;
            case "쿠션/방석":
                return sub051503;
            case "결혼/가족":
                return sub121301;
            case "요리":
                return sub121305;
            case "육아":
                return sub121306;
            case "인테리어/살림":
                return sub121304;
            case "임신/출산":
                return sub121302;
            case "자녀교육":
                return sub121303;
            case "건강":
                return sub122201;
            case "취미/레저":
                return sub122202;
            case "경영":
                return sub120302;
            case "경제":
                return sub120301;
            case "마케팅/세일즈":
                return sub120303;
            case "재테크/투자":
                return sub120304;
            case "국어":
                return sub121501;
            case "기타외국어":
                return sub121505;
            case "영어":
                return sub121502;
            case "일본어":
                return sub121503;
            case "중국어":
                return sub121504;
            case "교육학":
                return sub120709;
            case "국방/군사":
                return sub120703;
            case "법":
                return sub120704;
            case "사회복지":
                return sub120706;
            case "사회학":
                return sub120705;
            case "언론/미디어":
                return sub120707;
            case "정치/외교":
                return sub120701;
            case "행정":
                return sub120702;
            case "고전/문학":
                return sub120102;
            case "비평/창작/이론":
                return sub120107;
            case "세계 각국 소설":
                return sub120101;
            case "시":
                return sub120106;
            case "신화/전설/설화":
                return sub120108;
            case "장르소설":
                return sub120103;
            case "테마문학":
                return sub120104;
            case "검정고시":
                return sub121804;
            case "경제/금융/회계/물류":
                return sub121806;
            case "고등고시/전문직":
                return sub121803;
            case "공무원":
                return sub121802;
            case "공인중개/주택관리":
                return sub121807;
            case "국가자격/전문사무":
                return sub121808;
            case "취업/상식/적성검사":
                return sub121801;
            case "컴퓨터수험서":
                return sub121811;
            case "어린이영어":
                return sub121204;
            case "초등1~2학년":
                return sub121201;
            case "초등3~4학년":
                return sub121202;
            case "초등5~6학년":
                return sub121203;
            case "예술 에세이":
                return sub120210;
            case "국내여행":
                return sub121401;
            case "지도":
                return sub121404;
            case "테마여행":
                return sub121403;
            case "해외여행":
                return sub121402;
            case "동양사":
                return sub120604;
            case "서양사":
                return sub120603;
            case "세계사":
                return sub120602;
            case "역사학/이론/비평":
                return sub120601;
            case "한국사":
                return sub120605;
            case "TV/라디오":
                return sub120908;
            case "건축":
                return sub120904;
            case "만화/애니메이션":
                return sub120905;
            case "미술":
                return sub120902;
            case "사진":
                return sub120906;
            case "연극/공연/영화":
                return sub120907;
            case "예술일반/예술사":
                return sub120901;
            case "음악":
                return sub120903;
            case "인문/사회/종교":
                return sub122115;
            case "0~3세":
                return sub121101;
            case "4~7세":
                return sub121102;
            case "유아그림책":
                return sub121104;
            case "유아놀이책":
                return sub121103;
            case "유아학습":
                return sub121105;
            case "정가제free":
                return sub121106;
            case "심리":
                return sub120502;
            case "언어학/기호학":
                return sub120504;
            case "인문일반":
                return sub120501;
            case "종교학/신화학":
                return sub120505;
            case "철학":
                return sub120503;
            case "과학":
                return sub120810;
            case "경제/시사":
                return sub122011;
            case "리빙/육아":
                return sub122010;
            case "문예/교양지":
                return sub122001;
            case "어학/고시/교육":
                return sub122004;
            case "여행/취미/스포츠":
                return sub122006;
            case "연예/영화/만화":
                return sub122005;
            case "예술/사진/건축":
                return sub122013;
            case "외국잡지":
                return sub122007;
            case "자연/공학":
                return sub122002;
            case "컴퓨터/게임/그래픽":
                return sub122003;
            case "논술/면접대비":
                return sub121707;
            case "그래픽/멀티미디어":
                return sub121601;
            case "오피스활용도서":
                return sub121602;
            case "RAM":
                return sub042402;
            case "그래픽카드":
                return sub042403;
            case "메인보드":
                return sub042404;
            case "인터페이스카드":
                return sub042408;
            case "쿨러":
                return sub042409;
            case "튜닝용품":
                if(sectag.equals("PC부품"))
                    return sub042410;
                else if(sectag.equals("자동차용품"))
                    return sub090420;
                else
                    return sub00;
            case "파워서플라이":
                return sub042406;
            case "USB액세서리":
                return sub041601;
            case "게임기주변기기":
                return sub041405;
            case "가습기":
                return sub041113;
            case "공기정화기":
                return sub041114;
            case "냉풍기":
                return sub041115;
            case "보일러":
                return sub041104;
            case "선풍기":
                return sub041116;
            case "에어컨":
                return sub041110;
            case "에어컨주변기기":
                return sub041117;
            case "온수기":
                return sub041105;
            case "온풍기":
                return sub041103;
            case "전기매트/장판":
                return sub041101;
            case "전기요/담요/방석":
                return sub041102;
            case "제습기":
                return sub041111;
            case "히터":
                return sub041119;
            case "공유기":
                return sub042501;
            case "랜카드":
                return sub042502;
            case "노트북보호필름":
                return sub040203;
            case "DVR":
                return sub042202;
            case "PC스피커":
                return sub042204;
            case "사운드카드":
                return sub042209;
            case "영상수신장비":
                return sub042208;
            case "영상편집카드":
                return sub042210;
            case "건조기/탈수기":
                return sub040702;
            case "구강청정기":
                return sub040710;
            case "다리미":
                return sub040704;
            case "디지털도어록":
                return sub040705;
            case "무전기":
                return sub040706;
            case "세탁기":
                return sub040701;

            case "전화기":
                return sub040709;
            case "청소기":
                return sub040703;
            case "TV":
                return sub040501;
            case "영상가전액세서리":
                return sub040502;
            case "영상플레이어":
                return sub040505;
            case "프로젝터":
                return sub040503;
            case "프로젝터주변기기":
                return sub040504;
            case "MP3/PMP액세서리":
                return sub040619;
            case "마이크":
                return sub040603;
            case "블루투스셋":
                return sub040620;
            case "스피커":
                return sub040610;
            case "오디오":
                return sub040602;
            case "이어폰/헤드폰액세서리":
                return sub040623;
            case "카세트플레이어":
                return sub040613;
            case "홈시어터":
                return sub040601;
            case "면도기":
                return sub040801;
            case "면도기소모품":
                return sub040802;
            case "내비게이션/액세서리":
                return sub041002;
            case "방음/방진용품":
                return sub041009;
            case "블랙박스/액세서리":
                return sub041001;
            case "자동차AV용품":
                return sub041010;
            case "자동차TV/모니터":
                return sub041005;
            case "전방/후방카메라":
                return sub041004;
            case "카오디오음향기기":
                return sub041006;
            case "카팩":
                return sub041007;
            case "하이패스/GPS":
                return sub041003;
            case "헤드유닛":
                return sub041008;
            case "공미디어":
                return sub042308;
            case "가스레인지":
                return sub040905;
            case "김치냉장고":
                return sub040902;
            case "냉장고":
                return sub040901;
            case "식기세척/건조기":
                return sub040914;
            case "오븐":
                return sub040909;
            case "전기밥솥":
                return sub040907;
            case "전기쿠커":
                return sub040937;
            case "전기포트":
                return sub040915;
            case "전용냉장고":
                return sub040904;
            case "정수기":
                return sub040916;
            case "커피머신":
                return sub040917;
            case "토스터기":
                return sub040918;
            case "마우스":
                return sub042101;
            case "복합기":
                return sub042105;
            case "복합기/프린터소모품":
                return sub042107;
            case "스캐너":
                return sub042108;
            case "키보드":
                return sub042102;
            case "태블릿/액세서리":
                return sub042104;
            case "프린터":
                return sub042106;
            case "LCD용품/보호필름":
                return sub040416;
            case "렌즈용품":
                return sub040406;
            case "메모리카드":
                return sub040409;
            case "삼각대/헤드":
                return sub040413;
            case "즉석카메라":
                return sub040407;
            case "충전기/배터리":
                return sub040415;
            case "카드리더기":
                return sub040410;
            case "카메라/캠코더 관련용품":
                return sub040418;
            case "카메라가방/케이스":
                return sub040411;
            case "카메라렌즈":
                return sub040405;
            case "카메라스트랩/그립":
                return sub040412;
            case "플래시/조명용품":
                return sub040414;
            case "필름/관련용품":
                return sub040417;
            case "필름카메라":
                return sub040408;
            case "태블릿PC보호필름":
                return sub041803;
            case "학습기기액세서리":
                return sub041306;
            case "휴대폰배터리":
                return sub040304;
            case "휴대폰보호필름":
                return sub040302;
            case "휴대폰충전기":
                return sub040303;
            case "휴대폰케이스":
                return sub040301;
            case "시계":
                if(sectag.equals("인테리어소품"))
                    return sub050903;
                else if(sectag.equals("시계/기프트"))
                    return sub110301;
                else
                    return sub00;
            case "MP3/이어폰/헤드폰":
                return sub110604;
            case "가전제품":
                return sub110603;
            case "카메라/캠코더":
                return sub110602;
            case "가방":
                if(sectag.equals("패션/잡화"))
                    return sub110501;
                else if(sectag.equals("유아동잡화"))
                    return sub062602;
                else
                    return sub00;
            case "신발":
                if(sectag.equals("패션/잡화"))
                    return sub110509;
                else if(sectag.equals("유아동잡화"))
                    return sub062601;
                else
                    return sub00;
            case "의류":
                return sub110508;
            case "지갑":
                return sub110502;
            case "메이크업":
                return sub110102;
            case "스킨케어":
                return sub110101;
            case "드라마":
                if(sectag.equals("DVD"))
                    return sub091002;
                else if(sectag.equals("블루레이"))
                    return sub092902;
                else
                    return sub00;
            case "영화":
                if(sectag.equals("DVD"))
                    return sub091001;
                else if(sectag.equals("블루레이"))
                    return sub092901;
                else
                    return sub00;
            case "체중계":
                return sub091401;
            case "목공공구":
                return sub090104;
            case "설비공구":
                return sub090105;
            case "소형기계":
                return sub090111;
            case "수작업공구":
                return sub090102;
            case "안전용품":
                return sub090119;
            case "에어공구":
                return sub090110;
            case "예초기":
                return sub090108;
            case "용접공구":
                return sub090107;
            case "운반용품":
                return sub090115;
            case "원예공구":
                return sub090109;
            case "전기용품":
                if(sectag.equals("공구"))
                    return sub090112;
                else if(sectag.equals("자동차용품"))
                    return sub090416;
                else
                    return sub00;
            case "전동공구":
                return sub090101;
            case "절삭공구":
                return sub090106;
            case "접착용품":
                return sub090117;
            case "체결용품":
                return sub090118;
            case "측정공구":
                return sub090103;
            case "페인트":
                return sub090113;
            case "페인트용품":
                return sub090114;
            case "포장용품":
                return sub090116;
            case "노트/수첩":
                return sub090202;
            case "다이어리/플래너":
                return sub090203;
            case "데스크용품":
                return sub090206;
            case "문구용품":
                return sub090213;
            case "보드/칠판":
                return sub090207;
            case "사무기기":
                return sub090209;
            case "사무용품":
                return sub090217;
            case "스탬프/도장":
                return sub090212;
            case "스티커/테이프":
                return sub090211;
            case "앨범":
                return sub090204;
            case "용지":
                return sub090208;
            case "이벤트/파티용품":
                return sub090205;
            case "제도용품":
                return sub090210;
            case "지도/지구본":
                return sub090215;
            case "카드/엽서/봉투":
                return sub090216;
            case "파일/바인더":
                return sub090214;
            case "필기도구":
                return sub090201;
            case "강아지 간식":
                return sub090807;
            case "강아지 건강/관리용품":
                return sub090809;
            case "강아지 배변용품":
                return sub090808;
            case "강아지 사료":
                return sub090806;
            case "강아지 장난감/훈련":
                return sub090811;
            case "고양이 간식":
                return sub090813;
            case "고양이 건강/관리용품":
                return sub090815;
            case "고양이 배변용품":
                return sub090814;
            case "고양이 사료":
                return sub090812;
            case "고양이 장난감":
                return sub090817;
            case "리빙용품":
                return sub090818;
            case "미용/목욕":
                return sub090810;
            case "서비스":
                return sub090823;
            case "식기/급수기":
                return sub090820;
            case "야외용품":
                return sub090822;
            case "이동장/외출용품":
                return sub090821;
            case "패션용품":
                return sub090819;
            case "보안용품":
                return sub093309;
            case "생리대":
                return sub093302;
            case "생활잡화":
                return sub093308;
            case "섬유유연제":
                return sub093305;
            case "성인용기저귀":
                return sub093303;
            case "세제/세정제":
                return sub093304;
            case "제습/방향/탈취":
                return sub093306;
            case "해충퇴치용품":
                return sub093307;
            case "화장지":
                return sub093301;
            case "빨래건조대":
                return sub091301;
            case "선반/진열대":
                return sub093101;
            case "옷걸이":
                return sub093103;
            case "정리함":
                return sub093102;
            case "게임":
                return sub090506;
            case "모형/프라모델/피규어":
                return sub090508;
            case "무선/RC":
                return sub090509;
            case "서바이벌":
                return sub090510;
            case "아이돌굿즈":
                return sub090515;
            case "우표/씰":
                return sub090512;
            case "중고도서":
                return sub090513;
            case "코스튬플레이":
                return sub090514;
            case "퍼즐/블록":
                return sub090507;
            case "화폐":
                return sub090511;
            case "휠체어":
                return sub091801;
            case "건반악기":
                return sub090703;
            case "관악기":
                return sub090705;
            case "국악기":
                return sub090707;
            case "기타(guitar)":
                return sub090701;
            case "기타악기":
                return sub090709;
            case "음향기자재":
                return sub090708;
            case "타악기":
                return sub090706;
            case "피아노":
                return sub090702;
            case "현악기":
                return sub090704;
            case "면도용품":
                return sub093005;
            case "비데/비데용품":
                return sub093001;
            case "샤워/목욕용품":
                return sub093006;
            case "샤워기/수전용품":
                return sub093004;
            case "수건/타월":
                return sub093007;
            case "욕실발판/욕실매트":
                return sub093011;
            case "욕실용기/홀더":
                return sub093010;
            case "욕실잡화":
                return sub093003;
            case "욕실장/선반":
                return sub093008;
            case "욕실청소용품":
                return sub093009;
            case "욕조/반신욕용품":
                return sub093002;
            case "위생도기":
                return sub093012;
            case "DIY용품":
                return sub090405;
            case "공기청정용품":
                return sub090409;
            case "램프":
                return sub090406;
            case "배터리용품":
                return sub090408;
            case "세차용품":
                return sub090410;
            case "수납용품":
                return sub090417;
            case "오일관리":
                return sub090413;
            case "익스테리어용품":
                return sub090414;
            case "인테리어용품":
                return sub090415;
            case "차량실내용품":
                return sub090407;
            case "키용품":
                return sub090411;
            case "타이어/휠":
                return sub090419;
            case "편의용품":
                return sub090412;
            case "휴대폰용품":
                return sub090418;
            case "교자상/밥상":
                return sub091209;
            case "냄비/솥":
                return sub091204;
            case "보관/밀폐용기":
                return sub091207;
            case "식기":
                return sub091202;
            case "와인용품":
                return sub091213;
            case "잔/컵":
                return sub091203;
            case "제과/제빵용품":
                return sub091214;
            case "제수용품":
                return sub091216;
            case "조리기구":
                return sub091211;
            case "주방수납용품":
                return sub091210;
            case "주방잡화":
                return sub091215;
            case "주전자/티포트":
                return sub091206;
            case "칼/커팅기구":
                return sub091208;
            case "커피용품":
                return sub091212;
            case "프라이팬":
                return sub091205;
            case "휴지통":
                return sub093201;
            case "물감/포스터컬러":
                return sub090308;
            case "미술도구수납용품":
                return sub090303;
            case "미술보조용품":
                return sub090304;
            case "붓":
                return sub090307;
            case "서예/동양화용품":
                return sub090302;
            case "스케치/드로잉용품":
                return sub090309;
            case "애니메이션용품":
                return sub090310;
            case "전문지류/미술지류":
                return sub090305;
            case "조소/판화용품":
                return sub090311;
            case "페인트/염료/잉크":
                return sub090306;
            case "골프백":
                return sub080302;
            case "골프연습용품":
                return sub080305;
            case "골프의류":
                return sub080303;
            case "골프잡화":
                return sub080304;
            case "골프클럽":
                return sub080301;
            case "골프필드용품":
                return sub080306;
            case "파크골프":
                return sub080310;
            case "낚시공구":
                return sub080609;
            case "낚시릴":
                return sub080602;
            case "낚시용품":
                return sub080607;
            case "낚시의류/잡화":
                return sub080608;
            case "낚싯대":
                return sub080601;
            case "낚싯줄":
                return sub080603;
            case "루어낚시":
                return sub080604;
            case "민물낚시":
                return sub080605;
            case "바다낚시":
                return sub080606;
            case "등산의류":
                return sub080102;
            case "등산잡화":
                return sub080105;
            case "등산장비":
                return sub080104;
            case "남성수영복":
                return sub080701;
            case "비치웨어":
                return sub080703;
            case "수영용품":
                return sub080704;
            case "여성수영복":
                return sub080702;
            case "보드복":
                return sub080501;
            case "스노보드장비":
                return sub080504;
            case "스키/보드방한용품":
                return sub080503;
            case "스키/보드용품":
                return sub080506;
            case "스키복":
                return sub080502;
            case "스키장비":
                return sub080505;
            case "스쿠터":
                return sub081206;
            case "오토바이부품":
                return sub081203;
            case "오토바이용품":
                return sub081202;
            case "오토바이의류/잡화":
                return sub081204;
            case "요가복":
                return sub080901;
            case "자전거/MTB":
                return sub080401;
            case "자전거부품":
                return sub080403;
            case "자전거용품":
                return sub080404;
            case "자전거의류/잡화":
                return sub080402;
            case "축구가방":
                return sub081304;
            case "랜턴":
                return sub080207;
            case "취사용품":
                return sub080208;
            case "캠핑가구":
                return sub080209;
            case "텐트/타프용품":
                return sub080203;
            case "러닝머신":
                return sub080801;
            case "웨이트기구":
                return sub080802;
            case "헬스소품":
                return sub080803;
            case "라면":
                return sub070901;
            case "면류":
                return sub070902;
            case "소스":
                return sub070907;
            case "수산가공식품":
                return sub070908;
            case "식용유/오일":
                return sub070905;
            case "장류":
                return sub070906;
            case "조미료":
                return sub070904;
            case "치즈":
                return sub070903;
            case "쿠킹박스":
                return sub070938;
            case "건강즙":
                return sub071110;
            case "과일즙":
                return sub071111;
            case "비타민제":
                return sub071104;
            case "영양제":
                return sub071109;
            case "한방재료":
                return sub071107;
            case "건과류":
                return sub070306;
            case "견과류":
                return sub070305;
            case "과일":
                return sub070303;
            case "쌀":
                return sub070301;
            case "잡곡/혼합곡":
                return sub070302;
            case "채소":
                return sub070304;
            case "곤약":
                return sub071209;
            case "건어물":
                return sub070205;
            case "김/해초":
                return sub070202;
            case "생선":
                return sub070201;
            case "젓갈":
                return sub070204;
            case "해산물/어패류":
                return sub070203;
            case "주스/과즙음료":
                return sub070604;
            case "차류":
                return sub070606;
            case "청량/탄산음료":
                return sub070603;
            case "커피":
                return sub070605;
            case "과실주":
                return sub071307;
            case "닭고기":
                return sub070103;
            case "돼지고기":
                return sub070101;
            case "쇠고기":
                return sub070102;
            case "알류":
                return sub070106;
            case "축산가공식품":
                return sub070107;
            case "공연/티켓":
                return sub100204;
            case "액티비티":
                return sub100205;
            case "e쿠폰":
                return sub100501;
            case "꽃/케이크배달":
                return sub100505;
            case "온라인 콘텐츠":
                return sub100504;
            case "지류/카드 상품권":
                return sub100503;
            case "아웃도어스포츠":
                return sub100604;
            case "수공예 클래스":
                return sub100101;
            case "쿠킹 클래스":
                return sub100102;
            case "외국어":
                return sub100701;
            case "학습교구":
                return sub063201;
            case "기능성기저귀":
                return sub060203;
            case "기능성물티슈":
                return sub060305;
            case "감각발달완구":
                return sub063003;
            case "공간놀이기구":
                return sub063004;
            case "물놀이용품":
                return sub063005;
            case "미술놀이":
                return sub063006;
            case "블록":
                return sub063007;
            case "스포츠완구":
                return sub063008;
            case "승용완구":
                return sub063009;
            case "신생아/영유아완구":
                return sub063011;
            case "언어/학습완구":
                return sub063012;
            case "역할놀이/소꿉놀이":
                return sub063013;
            case "원목교구/가베":
                return sub063014;
            case "유아/어린이자전거":
                return sub063010;
            case "유아동퍼즐":
                return sub063016;
            case "음악/악기놀이":
                return sub063017;
            case "자연/과학완구":
                return sub063015;
            case "작동완구":
                return sub063002;
            case "유모차용품":
                return sub060705;
            case "헤어액세서리":
                return sub062616;
            case "임부속옷":
                return sub061910;
            case "태교용품":
                return sub062007;
            case "돌잔치용품":
                return sub062202;
            case "셀프촬영":
                return sub062201;
            case "카시트용품":
                return sub060804;
            case "보정속옷":
                if(sectag.equals("남성언더웨어/잠옷"))
                    return sub010406;
                else if(sectag.equals("여성언더웨어/잠옷"))
                    return sub010206;
                else
                    return sub00;
            case "시즌성내의":
                if(sectag.equals("남성언더웨어/잠옷"))
                    return sub010405;
                else if(sectag.equals("여성언더웨어/잠옷"))
                    return sub010205;
                else
                    return sub00;
            case "언더웨어소품":
                return sub010210;
            case "기능화":
                if(sectag.equals("남성신발"))
                    return sub020213;
                else if(sectag.equals("여성신발"))
                    return sub020110;
                else
                    return sub00;
            case "운동화":
                if(sectag.equals("남성신발"))
                    return sub020201;
                else if(sectag.equals("여성신발"))
                    return sub020106;
                else
                    return sub00;
            case "스냅백":
                return sub020901;
            case "야구모자":
                return sub020903;
            case "남성벨트":
                return sub020802;
            case "시계소품":
                return sub021505;
            case "패션시계":
                return sub021504;
            case "남성양말":
                return sub021102;
            case "여성양말":
                return sub021101;
            case "가방소품":
                return sub020407;
            case "단화":
                return sub020104;
            case "부츠":
                if(sectag.equals("남성신발"))
                    return sub01;
                else if(sectag.equals("여성신발"))
                    return sub020101;
                else
                    return sub00;

            case "샌들":
                return sub020109;
            case "워커":
                return sub020103;
            case "힐/펌프스":
                return sub020105;
            case "귀걸이":
                return sub021702;
            case "목걸이":
                return sub021703;
            case "반지":
                return sub021701;
            case "발찌":
                return sub021708;
            case "주얼리세트":
                return sub021706;
            case "주얼리소품":
                return sub021707;
            case "팔찌":
                return sub021704;
            case "펜던트":
                return sub021705;
            case "남성지갑":
                return sub020702;
            case "여성지갑":
                return sub020701;
            case "넥타이":
                return sub021403;
            case "라이터/담배용품":
                return sub021419;
            case "브로치":
                return sub021413;
            case "손수건":
                return sub021402;
            case "스카프":
                return sub021401;
            case "스타킹":
                return sub021412;
            case "양산":
                return sub021411;
            case "우산":
                return sub021410;
            case "가발":
                return sub021301;
            case "파우더":
                return sub030206;
            case "파운데이션":
                return sub030205;
            case "메이크업브러시":
                return sub031305;
            case "아이소품":
                return sub031301;
            case "페이스소품":
                return sub031302;
            case "헤어소품":
                return sub031303;
            case "아이라이너":
                return sub030307;
            case "태닝":
                return sub030607;
            case "파마약":
                return sub031107;
            case "PC케이블":
                return sub042407;
            case "ODD":
                return sub042307;
            case "텐트":
                return sub080201;

            case "소분류 사용안함":
                return sub00;
            default:
                return sub01;
        }
    }
}
